[
  {
    "": "If you're looking for your next freelance contract then get in touch now. At any given time, we have a host of new opportunities across sectors and levels and for varying periods of time. We specifically have contracts (short term and longer term maternity covers, sabbaticals etc) for Senior Account Executives and Account Managers to Account Director and even Business Directors to work either agency or client side and on b2b, consumer and corporate comms.\n\nTo be able to parachute into any given situation, you'll need:\n\n- Spectacular media relations skills\n\n- Unrivalled knowledge across the media landscape\n\n- Trusted client communications ability\n\n- Multifaceted, quick on the uptake written skills\n\n- Efficient reporting knowledge\n\n- To be well organised\n\n- Able to work to tight deadlines\n\nIn short, focused, flexible and unflappable\n\nWe have a continuous stream of freelance contracts across all sectors (consumer, corporate, b2b/b2c) With a whole raft of leading London and Southwest... England agencies and in house press office teams across all levels – Senior Account Executive, Account Managers to Account Directors/Seniors all paying good day rates.\n\nAll you need do (if youve got all of the above) is to be available"
  },
  {
    "": "This creative agency in Central London are looking for freelance support from a Strategist who has experience working in the charitable sector and/or experience developing fundraising strategies.\n\nThis booking will see you working on a number of upcoming pitches with high-profile charity organisations, crafting effective strategies to implement across integrated campaigns.\n\nThe ideal candidate…\n• Will have worked on campaigns with charities and not-for-profits or client-side in the sector\n• Will be familiar with the fundraising world and the charitable sector's ways of working\n• It would be ideal to have an understanding of how to drive new incentives and innovative ways to increase income generation for clients (e.g. through NPD, Legacies and In Memory)\n• Will be senior enough to pick up projects and run with them - there will be support from the wider team but a level of confidence and autonomy is needed here\n\nThis is to run for 3 months minimum and the start date can be flexible... although the sooner the better!\n\nPlease only get in touch if you have an understanding and experience in the above:\n\nstrategy@tomorrowlondon.co.uk"
  },
  {
    "": "Job Profile Teaching - Technology Tutor\n\nContract Type Freelance\n\nJob Purpose\n\nThis role will be online based - live delivery\n\nBPP's School of Business & Technology is recruiting for Associate faculty roles to accommodate the demand needs within the School across our Degree and Apprenticeship programmes.\n\nWe are looking for highly motivated, practitioner-experienced lecturers to bring high quality teaching, content creation and module leadership into the School in this area.\n\nWe are interested in practitioners from various commercial sectors with experience and/or certification in Apache Spark, to support on our MSc Applied Data Science programme.\n\nJob Background\n\nThe role of the faculty within the School is to develop, co-ordinate and deliver engaging teaching and learning materials (across Levels 4 to 7) to ensure that learners within the School receive a premium education and learning experience.\n\nThe key duties of Associate Faculty on these programmes will be teaching (mainly... online live delivery, via our Adobe Connect platform), module leadership and module material development. There is also the opportunity to undertake a variety of additional duties including, but not restricted to assessment marking and project supervision across the wider School.\n\nKey Responsibilities:\n\nTeaching, Module Leadership and Module Development\n• Be accountable for high quality module learning and resource development, using relevant professional syllabus material to create high quality, engaging teaching and learning materials, including formative multiple choice and other assessment materials.\n• Develop and deliver high quality and consistent teaching materials including detailed schemes of work, topic guidance, activity checklists, content, (including webinar slides and resources). Delivery can be a combination of 2-3 hour segments across the working day or on weekday evenings depending on the programmes and modules taught.\n• Provide high quality module leadership and be accountable for the standard of the module materials and resources. Ensure high quality and consistent teaching through the provision of detailed teaching guidance and academic support.\n\nAdditional roles\n• Examining, assessment and marking within the relevant programmes.\n• Supervising student projects within the relevant programmes.\n\nDepartment School of Business and Technology - SOBAT Faculty\n\nLocation UK, Home Based, Home Based\n\nCandidate Criteria\n\nEssential\n• Relevant first degree and/or Professional Qualification(s) applicable to your subject area and level of teaching\n• Apache Spark experience and/or certification\n• Significant practitioner experience relevant to the discipline\n• Experience of negotiation with and managing different stakeholders\n• Excellent written and verbal communication skills\n• Excellent presentation skills\n• Commercially and educationally focussed with leadership and coaching skills\n• The ability to effectively plan, organise and prioritise workload\n• The ability to work well in a team and be collaborative\n• Excellent computer/IT skills\n\nPlease note successful candidates will be required to undergo a DBS check\n\nDesirable\n• A teaching qualification relevant to the discipline; or Fellowship of the HEA; or a commitment to achieving either of these through BPP's PGCLT (Post Graduate Certificate in Learning & Teaching) or Headway, BPP's accredited CPD scheme\n• Other industry related professional accreditations and/or certifications\n• Experience of teaching the subject at a Further (Level 3) and/or Higher (Levels 4-7) Education level\n• Experience in teaching live online and/or of delivering training and seminars\n• Experience in developing schemes of work and engaging online content\n• Experience of providing guidance and leadership to a teaching team\n• Experience/awareness of delivery needs for work based learners\n• Experience of supporting students in an academic context\n\nEmployment Details\n\nContract Hours Freelance\n\nFTE Freelance\n\nSalary Competitive\n\nAttachments\n\nFull Job Description\n\nFreelance Tutors - Apache Sparke.pdf (315 Kb"
  },
  {
    "": "\"\n\nWe are looking for a freelance Frontend Developer interested in joining our Technology department for a six months full-time project. As a Frontend Developer at AKQA, you are responsible for building beautiful, cutting-edge and high-performing solutions that meet clients’ goals and needs.\n\nYou will be in charge of designing, developing and maintaining high-quality and responsive user interfaces, accessible on latest-generation devices (both desktop and mobile), and with different ways of interaction (pointing devices, touchscreen, remote controller).\n\nYou will understand clients’ goals and needs and partner with Art Directors and UX Designers to create interfaces that deliver the best customer experiences. You are familiar with performance analytics and user action tracking tools, and are naturally inclined to monitor existing interfaces to continually improve your own work.\n\nWe are looking for candidates able to combine technical expertise in state-of-the art development... technology with design and user experience themes. Driven by enthusiasm and a desire to grow, you keep constantly updated with evolutions in the innovation and technology fields, and listen to different perspectives with an open-minded approach.\n\nLocated in our client’s office in Rome, you will work within multidisciplinary project teams to build robust digital products that surpass client expectations. You will join a close-knit and high-skilled team and gain hands-on experience as you design, code, test, launch and sustain digital solutions that enable satisfying and seamless experiences for people out there.\n\nROLE REQUIREMENTS\n• You understand clients’ goals and needs and partner with Art Directors and UX Designers to create interfaces that deliver the best customer experiences;\n• You have a deep knowledge of CSS3/HTML5, Canvas, and SVG and of Design Patterns applied to JavaScript;\n• You have a deep knowledge of Responsive Web Design (including development and tests);\n• You have knowledge and experience of JavaScript frameworks (e.g. ReactJS and/or VueJS and/or AngularJS) and modern tools and workflows (e.g. Yarn, Gulp, Webpack, npm);\n• You strive to learn and apply best practices to optimize pages for response times (zero latency);\n• You have experience of building CSS animations and transitions and a basic understanding of how repaints and reflows work within the browser;\n\nQUALITIES AND CHARACTERISTICS\n• Driven by enthusiasm and a desire to grow, you keep constantly updated about the evolutions in the innovation and technology field;\n• You have a collaborative spirit and you make a point of listening to different perspectives with an open-minded approach;\n• You proactively plan his/her activities according to goals and deadlines, while always ensuring a high level of quality;\n• You demonstrate awareness and care to analytics and KPIs to improve the interface performance and a high level of accountability through the whole project lifecycle.\n\nAKQA is an Equal Opportunity Employer; we believe that diversity is vital to AKQA’s ability to provide our clients with the best recommendations and are committed to fostering a varied and inclusive work environment. Your race, colour, ancestry, religion, gender, gender identity, national origin, sexual orientation, age, marital status, disability, or veteran status have no bearing on our hiring decisions. If you have a disability or special need that requires accommodation, please let us know"
  },
  {
    "": "A fantastic new opportunity for a Freelance Social Account Manager to join a leading PR and Communications agency as soon as possible. The Freelance Social Account Manager will be coming in to work on one of the agencies biggest accounts so the ideal The Freelance Social Account Manager will be up to date and aware of the latest social media trends and changes.\n\nStart date, immediate and a 3-month project.\n\nThe Freelance Social Account Manager will be:\n\nManaging the client’s global social media channels, across Facebook, Instagram, Twitter, YouTube and LinkedIn.\nDelivering social strategy, creative ideas and producing content, all informed by data and deployed in collaboration with media planning.\nCreating content calendars\nThe voice of the brand on social channels.\nThe Freelance Social Account Manager will have:\n\nExperience working with Technology brands\nGood experience of influencer relations/campaign management\nExceptional written skills for creating and editing engaging social... media copy and content, with close attention to detail to avoid any typos or room for error\nExperience creating content in line with tone of voice and brand guidelines\nStrong knowledge and confident use of social media platforms (Facebook, Twitter, Instagram, YouTube and LinkedIn) and keeps on top of new features and platforms\nIf this role is of interest, please apply or email There are interview slots for Tuesday 17th and Wednesday 18th March"
  },
  {
    "": "Our client is global creative production company based in East London. They produce branded content, short- and long-form, social media and commercials for some of the biggest national and international brands.\n\nThey now need a freelance 2D Animator to work on some very fun videos they have already produced. Turnaround is quick and there’s a good chance of getting involved in several projects over the coming weeks.\n\nAfter Effects is an absolute must. Experience in sports content and kinetic typography a great plus.\n\nThey seek talent who is happy to work to £200-250 a day budgets, and in return you will be exposed to some fantastic work and ongoing work collaborations."
  },
  {
    "": "Superb freelance opportunity within a successful design consultancy that offers a holistic approach to design covering multiple disciplines. They are a concept-driven and contemporary studio that has a global portfolio of beautiful crafted hospitality environments that are forward thinking and resonate with guests.\n\nYou must be AutoCAD and SketchUp fluent,and have strong technical skills as the main responsibilty will be to produce detailed drawing packages.\n\nSo if you are looking to work for a inspiring consultancy that have a highly respected reputation within the hospitality industry and are immediately available for work - then please get in touch.\n\n4-8 weeks work.\n\nTo receive up-to-the-minute job info, just follow us on at Twitter.com/networkrecruit Network is acting as an Employment Business in relation to this vacancy and is an Equal Opportunities and Age Positive Employer."
  },
  {
    "": "We are a women's footwear brand looking for a freelance stylist to work with us on our social media photoshoots. These take place every 1 month - 2 months.\n\nResponsibilities will include:\n\nPre shoot:\nReview the full photoshoot brief\nPlan and source all looks (to be approved by BT team)\nPlan which shoes to pair with the looks from a selection provided by the BT team (looks must always cover several pairs of shoes)\nSteam and prepare all clothing\n\nDuring Shoot:\nDress model in clothing and shoes\nBe present throughout the shoot correcting any styling issues that occur\nTake full responsibility for the organisation of all shoe samples, props, and styling throughout the shoot\nEnsure styling is kept orderly\nEnsure styling is wrinkle free\nTweak clothing as necessary to ensure styling fits properly\nMonitor the fit of the shoes in the imagery and if necessary use insoles to improve the fit\n\nAfter shoot:\nAdvise retoucher of any editing required relating specifically to the styling\n\nPhotoshoots... often take place outdoors. We currently use a styling van, laying clothing out in dress bags to keep clothing crease free.\n\nStyling must always be true to the Butterfly Twists women. (Aged 30 - 50, modern woman, lives in a city, always looks nice with an effortless style, not a follower of trends, timeless with elements of fun and colour.) Styling should never detract from or cover the shoes.\n\nFee on a by project basis"
  },
  {
    "": "A fab new opportunity has just come up for a film editor to join this premium womenswear brand on a freelance basis.\n\nThis role could be working on anything from a campaign, to an event, to internal films or communication videos too. You will be working across various digital platforms in post-production as well as working with the offline team.\n\nYour responsibilities will include:\n- Producing files based on the creative brief\n- Inputting sound into the films\n- Digitally cutting the files to sequences the films\n- Preparing all assets for other post work production\n- Any other ad-hoc work that is needed for the team too\n\nThis role is to start ASAP so being immediately available is essential, and so if this sounds like the opportunity for you then apply now!"
  },
  {
    "": "SW - 007 - 1060\n\nFreelance Senior Account Manager / Account Director\n\nB2B / Corporate Comms\n\n£225 - £290 per day\n\n2 months\n\nCentral London\n\nHeadline of the Freelance Senior Account Manager / Account Director role\n\nMy client has an exciting opportunity for a creative Freelance Senior Account Manager / Account Director to join their dynamic and rapidly growing team. The role is for a 2-month period and will see you parachute into this global communications agency's London office. Operating in over 60 countries they are widely recognised as global leaders in integrated communications, having received a number of industry awards including 'Global Agency of the Year'.\n\nAbout the agency the Freelance Senior Account Manager / Account Director will be working with\n\nAs Freelance Senior Account Manager / Account Director you will be working with a diverse team of industry experts across B2B Corporate Communications. The agency are proud of their entrepreneurial, like- minded industry experts... and are looking for a PR superstar that will thrive in a collaborative and progressive working environment, based out of the agency's modern open plan EMEA HQ in the heart of London.\n\nKey aspects to the Freelance Senior Account Manager / Account Director role\n• Craft engaging purpose led content for the client's digital channels\n• Work closely with senior members in the account team to assist in the development and implementation of PR campaigns across EMEA to raise awareness of the clients' offering and products across key publications\n• Play a key role in activities including content creation, media relations, social media and digital PR and international events\n• Coordinate with teams across EMEA and gain high-profile coverage for exciting global campaigns\n• Work with the client's key stakeholders to help raise their profiles in the media through executive profiling\n• Engage with the media to create purpose led content and briefing documents\n\nKey skills of the ideal freelance Senior Account Manager / Account Director\n• Proven media relations practitioner with a track record of landing impactful coverage in some of the hardest to reach publications\n• Well-connected with the most influential UK and international business and trade media\n• Obsessed with news and cultural trends and how they can translate to your clients' audiences - through earned media and paid, owned and shared channels\n• Comfortable with providing strategic counsel to senior clients\n• Confident in measurement techniques to demonstrate the value of media relations and entrepreneurial in spotting client growth opportunities\n\nKey requirements of the Freelance Senior Account Manager / Account Director role\n• A strong desire to deliver exceptional corporate though led campaigns\n• Ability to build strong relationships\n• Tenacious, proactive and creative\n• Strong instinct for leadership and management\n• Ambitious and hungry to help grow the agency's offering\n• Hungry to win new business and able to spot opportunities\n• Available ASAP for Freelance\n• The Freelance Senior Account Manager / Account Director will receive a salary of between £225 to £290 depending on experience\n\nFor more information about the Freelance Senior Account Manager / Account Director role or to discuss any of our other vacancies send your CV now to Steve Woodward at stevew@reuben-sinclair.com or call 0203 826 1210"
  },
  {
    "": "Become an In2 Freelancer!\n\nWe have seen a recent increase in the number of requests for flexible short-term cover and long-term 3, 6 or 12 months contract assignments with our AV clientele.\n\nWe are actively seeking freelance/contract AV/VC Technicians across the whole of the UK to work on-site at Financial institutions and large corporate customer sites covering the busy summer period.\n\nSuitable candidates will be available for a quick start and have customer facing, corporate experience providing technical support involving all aspects of audio visual, video conferencing, displays and presentations.\n\nOur contract/freelance roles would suit a seasoned freelancer looking for additional days/weeks work, or alternatively, someone in between jobs or out of work looking for a short to medium term solution.\n\nPlease note, actual day rates are Dependent on specific site and experience/skill-set of workers.\n\nDesired AV Technician experience:\n• A strong understanding and operational knowledge... of video conferencing and audio-visual systems with the ability to diagnose and Remedy any faults and problems.\n• Ensure all systems are fully functional and provide troubleshooting or handover to relevant personnel to allow minimum system down time.\n• Ability to adapt to various clients' needs and be able to fully integrate with multiple teams at short notice.\n• Experience in assisting and supporting internal and external high priority events and/or meeting room technology.\n• Good communication skills, both verbal and written, and the ability to communicate with all levels within an organisation.\n\nIn2 Resourcing have decades of experience running temporary recruitment desks. We provide prompt weekly payment and full support with company formation or umbrella payroll set-up as well as contract compliance"
  },
  {
    "": "Freelance Quantity Surveyor\n\nImmediate Start\n\nA well-established and regarded Cost Consultancy are in need of a Chartered Quantity Surveyor to support them in Central London. - London Bridge.\n\nThe Quantity Surveyor will support for a minimum of 6 months to cover initial support on a hotel project. The Quantity Surveyor will be providing a professional external service with pre and post contract duties.\n\nT...\n\nThis job was originally posted as ######"
  },
  {
    "": "This is a great opportunity for anyone looking to develop their career as a Roofing / Cladding Site Supervisor. This is an ongoing freelance job, based in Telford, Shropshire.\n\nTo be considered for the role of Roofing / Cladding Site Supervisor, you will need the following:-\n\nThe motivation and discipline to join an enthusiastic and organised team\nHold SMSTS certification\nHold CSCS & First Aid certification\nIT literacy and understanding of Windows and Outlook\nCertification for the following would be beneficial (but not essential):- Scaffold Inspection, Safety Net Inspection, Crane Supervisor\n\nExperience in roofing and cladding is essential.\n\nPlease contact me on (phone number removed) for more information."
  },
  {
    "": "HP - -\n\nFreelance PR Associate Director\n\nConsumer Tech\n\nDuration: month Contract\n\nLocation: London\n\nDay rate: £320- £400\n\nStart date: March\n\nAbout the company\n\nMy client has an amazing opportunity for an experienced Freelance PR Associate director to join their B2C, tech team on a month contract.\n\nThe company are a Global PR Agency that cover and have gained recognition within a number of consumer sectors, as well as tech, corporate and healthcare, alongside some of the world's biggest and most prestigious consumer brands. Employing around plus people, their modern and dynamic offices are based in the heart of the Westend, serving as both a hub for the company as well as an event space available to all their clients!\n\nAbout the Freelance PR Associate Director role\n\nAs an Associate Director, you will be working synonymously with senior leadership and liaising directly with the client, strategizing to bring their vision to fruition! They are currently recruiting for a Freelance... Associate Director to work with them on one of the fastest growing consumer tech brands in the world.\n\nKey responsibilities of the Freelance PR Associate Director\n• The associate director will be expected to curate plans and proposals for the client which display a high quality of creativity to bring the brand to the forefront of the consumer industry\n• Run the account working closely with other team members to achieve your vision\n• Maintain and develop client relationships, offering consultancy where appropriate\n• Ensure an exceptional quality of all work including working alongside KPI's set by client\n• Attention to detail\n\nAbout you\n• An excellent understanding of consumer tech\n• Extensive experience within team management ensuring deadlines are met whilst keeping the team motivated and engaged with the project either as an Associate Director\n• Display a strong strategic and creative ability within PR and on Social media within consumer PR or related industries (ideally within tech although other B2C industries will be considered)\n• Confident within financial management and working with large scale budgets\n\nTo apply for this role or to find more information regarding similar roles, please contact me directly via email on I look forward to hearing from you"
  },
  {
    "": "Talented freelance Account Manager / Account Director needed for my client based in central London. We are looking for someone to work for their consumer healthcare team, you must be able to start ASAP for 12 weeks+ contract.\n\nOne does not require oncology experience – BUT it’s essential that you have a good healthcare background and some great global and national media relations.\n\nYou will be support new business, drive media coverage and craft high quality content. You will need to hit the ground running and will support multiple clients from the offset. You will be supporting a great team on new business and marketing efforts to continue growth.\n\nDay to day will involve, but not limited to:\n• Pitching stories to journalists, drafting press releases and bylines\n• Developing media target lists\n• Creating key press materials\n• Providing and reporting analysis for campaign activities\n• Drafting client proposals\n• Supporting campaign and programme development.\n\nVisit our website... media-contacts.co.uk to see other vacancies we are currently recruiting for"
  },
  {
    "": "Working for an award winning, digital agency who work with creative, lead boutique clients. The Digital Design Director will head up a team of four Digital Creatives, whose experience ranges from Junior to Senior. At present the agency has in-house development and UX teams, who are headed respectively by Digital and UX Directors. The agency is looking for a Digital Design Director, who will operate at board level, and be the voice of all things digital creative within the business.\n\nReporting into the Creative Director, whose role is largely focused new business and being client facing. The Digital Design Director will act as a hands on mentor to their team and will be in charge of ensuring the progression of the creative voice of the agency. As this is a boutique agency, the Digital Design Director must be used to a role that is 80% hands on design, plus 20% team management and strategic leadership.\n\nAs a design leader, you will be confident communicating your ideas and will be used... to working in an Agile environment. At present the agency uses, Sketch and InVision, however they are keen to ensure they are always at the forefront of evolving design technology so are constantly looking at new design software and methodology.\n\nThe Digital Design Director, will play a pivotal role in leading and developing the agency's digital creative offering. As such, my client is looking for someone who wants to make a long term freelance commitment, with a view to going permanent at the end of a six to twelve month contract.\n\nMy client is based near the station, in Guildford. They are specifically looking for someone who lives within an hours commute to their offices. The agency is classed as a small business by HMRC, so the decision around determining IR35 status sits with the freelancer, rather than the client. My client is offering a rate of up to £500 per day.\n\nProfiles Creative work with the most talented people across Design & Creative, Digital & Ecommerce, Social & Content, Marketing & Communications and PR & Client Services, partnering with the most innovative agencies, as well as top fashion houses, luxury brands, global retailers, media companies and cutting edge travel & leisure companies. We recruit comprehensively for permanent, contract, and freelance candidates at all levels throughout the UK and internationally.\n\nProfiles Creative is acting as an Employment Business in relation to this vacancy"
  },
  {
    "": "Freelancer Club supports creative talent via online connections, free business advice, access to freelance events and discounts."
  },
  {
    "": "Senior menswear garment technologist required to start immediately on a freelance basis for the next 2 months working across men’s jersey wear.\n\nResponsibilities Include\n• Running menswear fit sessions\n• Producing all fit comments and entering these into the system\n• Liaise with factories and development teams\n• Asses the fit, construction and quality of the garments\n• Carry out any product testing as required\n• Ensure all safety standards are met\nIf you have experience as a menswear technologist particularly in jersey and excellent knowledge of garment construction, apply now."
  },
  {
    "": "One of my wonderful clients, a true top digital transofrmation agency down in the heart that is Clerkenwell, are looking for a freelance UX Designer to work on a Transnational consumer goods company to start ASAP for 3 months minimum: - They need someone with product design experiences for a long, large scale model - Someone with a proven record of introduced new capabilities to the existing product/platform - Someone with a proven record of consumer insight-led approach, and able to deal with multiples clients across different brands on day to day - Someone with Consumer Products / Retail experiences would be great Now this role is inside IR35 just so you know, if that is all groovy with you, then do get in touch :)"
  },
  {
    "": "Freelancer Club supports creative talent via online connections, free business advice, access to freelance events and discounts."
  },
  {
    "": "A small but highly creative client on mine that only works with the most amazing brands around the world from here to Amsterdam and New York, are after a 3D designer with Vectorworks and Sketchup.\n\nYou must be fluent in Vectorworks for this role and have retail design experience in interiors, whereby you're probably a midweight who has been designing in this regard for a few years.\n\nInterviews will be held next week to start the week after, so if you're becoming available and have a creative folio and admirable CV, get in touch.\n\nTo receive up-to-the-minute job info, just follow us on at Twitter.com/networkrecruit Network is acting as an Employment Business in relation to this vacancy and is an Equal Opportunities and Age Positive Employer."
  },
  {
    "": "Senior menswear garment technologist required to start immediately on a freelance basis for the next 2 months working across men’s jersey wear.\n\nResponsibilities Include\n• Running menswear fit sessions\n• Producing all fit comments and entering these into the system\n• Liaise with factories and development teams\n• Asses the fit, construction and quality of the garments\n• Carry out any product testing as required\n• Ensure all safety standards are met\nIf you have experience as a menswear technologist particularly in jersey and excellent knowledge of garment construction, apply now."
  },
  {
    "": "Freelance Manual Pattern CutterFreedom are currently working with a number of high street suppliers and brands, across London, who require Manual Pattern Cutter's to join them on a freelance basis.Our client's specialise in a number of products across Ladies, Mens and Childrenswear and are looking for highly skilled Manual Pattern Cutter's.You will be responsible for ..."
  },
  {
    "": "One of my wonderful clients, a true top digital transofrmation agency down in the heart that is Clerkenwell, are looking for a freelance UX Designer to work on a Transnational consumer goods company to start ASAP for 3 months minimum: - They need someone with product design experiences for a long, large scale model - Someone with a proven record of introduced new capabilities to the existing product/platform - Someone with a proven record of consumer insight-led approach, and able to deal with multiples clients across different brands on day to day - Someone with Consumer Products / Retail experiences would be great Now this role is inside IR35 just so you know, if that is all groovy with you, then do get in touch :)"
  },
  {
    "": "Freelance Front-End Developer | £: comp day rate | Ongoing | Remote working\n\nOur client is a prestigious British sporting brand. They’re globally recognised with a history stretching back over 100 years.\n\nWe’re looking for a talented developer that will be responsible for building beautiful solutions that meet the client’s very high standards.\n• You’ll take the time to understand client’s goals and work with the team to create interfaces that deliver the best customer experiences\n• Deep knowledge of HTML5, CSS3 and Responsive Web Design\n• You have knowledge and experience of JavaScript frameworks (e.g. ReactJS and/or VueJS and/or Angular JS) and modern tools and workflows\n• You have experience of building CSS animations and transitions\n\nInitial face-to-face meetings/interviews will be required and f2f briefing meetings but we expect the majority (if not all) the work to be done remotely.\n\nPlease apply to find out more.\n\nWe consider every application and will get back to you with a... decision as soon as possible. We value diversity and are committed to equal opportunities"
  },
  {
    "": "Are you a Paid Social Manager looking for your next freelance opportunity?\n\nThis is an exciting freelance role that will see you work across a number of key client accounts and be an integral number of the integrated performance team.\n\nThis is a freelance role to start ASAP and can be long term for the right candidate. This is a London office based role that is inside IR35...... click apply for full job details"
  },
  {
    "": "Freelance Recruitment Business Development Manager\n\nSupported by the UK's fastest growing network of recruiters\n\nEarn up to 60% commission on placements - OTE £100k+ p.a.\n\nHave you been running your own desk?\nIs the commute getting you down? Would you prefer to work your own ours from anywhere?\nHave you got the Clients and want to feel confident the roles are going to be filled?\n\nThis is where Recruiterlink come in! We have over 50 experienced recruiters (specialising in all major sectors) working with us. They have access to all the major UK job boards and the very latest in talent attraction software!\n\nDon't take the risk and go it alone, partner up with Recruiterlink and we will provide you the candidates to maintain your Client relationships today.\nAll that is needed is Non-disclosure/compete agreements signed upon introduction so along with our performance you have peace of mind that whatever you have built, we will enable you to continue growing.\n\nAbout RecruiterLink\n•... Recruiterlink offers an unrivalled opportunity for ambitious, self-motivated recruitment sales professionals to build a successful business, increase their earning and strike a better work/life balance.\n• Using our proven platform and methodology, you can secure new clients for our network of expert recruiters on a generous fee share.\n• Recruiterlink provides you with all the tools and support you need to maintain and sustain your new position, there are NO FEES OR SETUP COSTS!\n\nBenefits\n• No hard sell, no upfront fee\n• Work your own hours\n• Operate from anywhere\n• Unique Platform\n• Unlimited new prospects\n• Full sales support\n• Unlimited and uncapped earnings\n\nThis is a unique opportunity for someone to really make their mark and take ownership of their income as well as their future.\n\nIf you are ready to take that next step, drop me an email at , call me on or apply through this advert for more information.\n\nBy applying for this role you accept the Jobzooma terms and conditions that can be found on our website and agree to receive email notification of other suitable jobs"
  },
  {
    "": "We work with a huge variety of clients in London from small production agencies, international network agencies, client side, marketing, branding and PR firms - if they have a creative department, we'll work them! Freelance is a big part of our business and we're always on the lookout for fresh freelance talent\n\nIf you're a freelance copywriter, either already an established freelancer or you are about to start your new adventure, I would love to speak to you\n\nOur clients may need you to work on tone of voice, brand guidelines or product toolkits\n\nYou may be asked to write a brochure or product copy on packaging or some other type of document\n\nThe client may need you to re-write an entire website or a web page or even a microsite\n\nSometimes you may be asked to write a script or social media posts\n\nA brief may require you to work in a conceptual capacity or execute a creative idea\n\nWe can offer you a wide range of freelance gigs and our clients sometimes only need you for a few hours... but sometimes for a few months if not longer\n\nWe can work with you if you're a limited company, PAYE or through an umbrella agency and we pay our freelancers weekly and operate a simple, paperless timesheet system\n\nDon't delay - get in touch today with your portfolio showing your experience and let's get you working! ***PLEASE READ BEFORE APPLYING*** Our clients typically only make use of freelancers that have comparable work experience\n\nThis means that if you have never worked as a freelance copywriter, freelance art director or in a freelance creative team AND you DO NOT have a portfolio showcasing your work (in the form of TV, press, OOH adverts, social posts and brand activations) your application will be unsuccessful\n\nSecondly, due to many applicants, we may not be able to reply to all applications, successful or not"
  },
  {
    "": "Purpose\n• To grow both sides of the B2B marketplace sustainably by leading CRM strategy, planning, implementation, measurement and optimisation (Hubspot).\n\nDimensions\n• Responsible for defining and implementing CRM to support B2B customer acquisition and lifetime value management.\n\nOrg context\n• Reporting to CMO\n• Peer Head of B2B marketing\n\nKey result areas\n• Defines CRM strategy to support B2B customer acquisition and lifetime value management. This is greenfield encompassing:\n• Lead nurture\n• Onboarding\n• In-life comms, upsell and referrals\n• Translates CRM strategy into a phased plan of activities aligned with the Sales team’s plans\n• Partners with the Head of B2B and the rest of the marketing team to deliver the plan.\n• Builds CRM journeys in Hubspot and sets up reporting / dashboards\n• Defines the content plan to support CRM requirements throughout the customer lifecycle\n• Analyses results and make recommendations to improve performance\n• Owns data infrastructure and ensures... measurement is accurate, comprehensive and systematic throughout the funnel.\n\nRequirements\n\nAbout you\n• Extensive Hubspot experience and deep knowledge of its functionality\n• Experience of building and optimising lead nurture programmes, in-life customer engagement programmes and automations in Hubspot\n• Experience defining CRM strategy and plans, with a track record of delivering CRM programmes with excellent results\n• Understand best practice for B2B marketing and CRM\n• Customer journey mapping experience\n• A growth mindset and evidence of continuous improvement\n• Strong analytical skills, able to translate data into hypotheses and creative solutions\n• Collaborative approach and able to galvanise support for plans from others\n• Excellent workshop facilitation and presentation skills\n• Commercial acumen and a focus on ROI\n• Strong project management and personal productivity skills\n• Experience in a scale-up environment\n• Preferably has CRM experience in a SaaS environment\n• Understanding of marketing theory and techniques gained through a marketing degree / masters, professional qualifications and / or experience\n\nBenefits\n\nThis role is a 3 month initial contract or a freelance or fixed term basis.\n\nWe want teams that enjoy spending time together. So we’ve built a culture that encourages teams to get to know each other - we run company-wide away days and annual retreats to get us away from the desk. Our in-house chef provides a freshly cooked lunch everyday, giving us the opportunity to catch up over great food (check out whatsjuliecooking for some inspiration!)\n\nOur teams work hard to make JustPark a success, so it’s important to us that they can share in that success. That’s why we offer stock options to every member of the team. We work hard to achieve some ambitious goals with the knowledge we’re building something truly valuable.\n\nWe trust that our team has the best interests of our customers at heart, which means we trust you to know what’s needed to get the job done. Whether that’s working the hours that suit you, setting you up for remote working or making sure you have the right kit, we’ll work with you to create the right environment for you to succeed. Plus we know it 's not all about work! That 's why we also offer benefits like unlimited holiday and enhanced maternity leave.\n\nWe’re in this for the long term, and we have big ambitions for the future. To help us get there, we want to grow our own superstars from within. We fund additional training, provide mentoring and work with you to develop a career plan so we can help you get where you want to go, too"
  },
  {
    "": "An opportunity has arisen for a Freelance PR Senior Account Manager to join a boutique leading PR agency who offer brand proposition development and strategic communications for their clients across the property and retail sphere. They are based in Central London and are looking for a Freelance PR Senior Account Manager to join them as soon as possible as they are entering an extremely busy period. Culture is very important to this close-knit team so the right Freelance PR Senior Account Manager will be bright, friendly and agile to the client’s needs whilst also being able to confidently discuss current trends (online and physical) within the property and/or retail world.\n\nThis agency very much embed their freelancers into the wider team and would be looking for someone who can work in a fast-paced environment both independently and part of a collaborative team.\n\nThe Freelance PR Senior Account Manager will have:\n• Strong media contacts within the b2b property, destination or retail... space\n• Proven experience delivering excellent coverage for clients\n• Experience working in a PR agency\n\nThe Freelance PR Senior Account Manager will be:\n• Working across several real estate and retail clients\n• Working on campaign creation, events and press office delivery\n• Planning and executing events\n\nContract length will be an initial 3 months, with potential for extension. ASAP start, but would wait a week or so for the right individual. I have interview slots available for Monday 16th March. Please apply or email your CV to for more details"
  },
  {
    "": "Freelance Medical Writer wanted for a short term contract within a Leading Healthcare Advertising agency based in London\nCan either be home or office based\nImmediate Start\nExcellent Daily Rate\nPrevious MedComms agency experience and a Life Science background essential\nIf you would like further details then please get in touch on 07713446745 uise.breen@clrrecruitment.co.uk"
  },
  {
    "": "We are looking for freelance cleaners (10-15 hrs/week) to join our team in Hackney Wick. The ideal candidate is willing to improve and become a trusted member of our friendly team. We offer solid training and support as well as good wage with the possibility of growing fast\n\nExperience: Not required\nEmployment: Part-time\nSalary: £8.5 – £9 hourly\nStarting time: Immediate start!\n\nAbout Bright Green Cleaning Services Ltd:\n\nWe treat our employees as members of the family, offering support and assistance at all times. Our employees are proud to be part of our brilliant team."
  },
  {
    "": "SITE MANAGER\nLOCATION: LONDON\nSALARY: £250-300 per day\n\nCapstone Recruitment are currently working with a construction company on the refurbishment of a theatre in London. This is a large multi-million pound refurbishment and due to complete within 4 months.\n\nSite Managers\n• Site based, 8am to 6pm, plus weekend as required.\n• SMSTS and first aid qualified with 10 years UK experience...... click apply for full job details"
  },
  {
    "": "Twelve-time Webby award-winning Freelancer.com is the world's largest freelancing and crowdsourcing marketplace. We connect millions of employers to freelancers across the globe, and every day thousands of jobs are described, bid on, negotiated, and managed through our site.\n\nWe think it is pretty cool that our dataset details a real life economy, where work is undertaken in every area you can think of. From design, writing, data entry and software development; through to sales, marketing, accounting and legal services - even NASA uses us!\n\nFreelancer's data science and analytics team is world class. We have a team of analysts/data scientists across three offices, with backgrounds in software engineering, mathematics, physics, neuroscience, computer science, and more. We have data infrastructure that runs a sophisticated dashboard and multi-variate testing framework.\n\nYou have a strong maths and/or stats background. You know how to take your code to O(log(n)), and when not to bother... You love to reach deep into a SQL dataset and pull out an interesting story. You think data and dream numbers.\n\nIf this sounds like you, you will love life as an analyst at Freelancer. We are a data-driven company - data trumps opinions. Every new feature gets A/B tested and analysed with our bayesian methods. We use machine learning in many places across the company, from improving funnels with sophisticated predictors to fraud and spam detection.\n\nThis role offers a unique opportunity to develop your analytics skills and progress to a Data Scientist position.\n\nYou will work in a product team and sit at the core of the decision making process. You will scour our well-organised dataset for trends and potential opportunities, and be responsible for analysing trends and picking up changes in the core metrics. And from time to time, you will invent new and awesome ways to use our dataset to make the site better.\n\nResponsibilities\n• Identify valuable data sources and automate collection processes\n• Undertake preprocessing of structured and unstructured data\n• Analyse large amounts of information to discover trends and patterns\n• Following up on changes and updates to the production systems.\n• Present information using data visualisation techniques\n• Propose solutions and strategies to business challenges\n• Collaborate with engineering and product development teams\n\nRequirements\n• Tertiary Degree in Maths, Stats, Physics, Computer Science, or other quantitative discipline. 1st class Honors are preferred.\n• Excellent SQL, python, pandas and scripting.\n• Ability to process complex datasets and transform them into business decisions.\n• Understanding of Internet-scale systems (scalability into tens of millions of users).\n• Extensive knowledge and experience in statistics, big data analytics a plus.\n• Proven experience as an analyst\n• Analytical mind and business acumen\n• Strong math skills (e.g. statistics, algebra)\n• Problem-solving aptitude\n• Excellent communication and presentation skills\n\nBenefits\n\nThis won’t be a cog-in-the-machine job. You will be exposed to the fast pace of a rapidly growing global technology company. And you will help entrepreneurs on our platform build their businesses.\n\nWe offer:\n• Competitive salary\n• Pension scheme\n• Regular appraisals and personal development plans\n• Relaxed dress code\n• Centrally located office with a fully-stocked kitchen and bar\n• Fun atmosphere, working with smart people\n• Transparent communication and no bureaucracy\n• Weekly team lunches\n• Regular paid social events, hackathons, and more\n\nFor more information see www.freelancer.com/careers"
  },
  {
    "": "Become an In2 Freelancer!We have seen a recent increase in the number of requests for flexible short-term cover and long-term 3, 6 or 12 months contract assignments with our AV clientele.\n\nWe are actively seeking freelance/contract AV/VC Technicians across the whole of the UK to work on-site at Financial institutions and large corporate customer sites covering the busy summer period.\n\nSuitable candidates will be available for a quick start and have customer facing, corporate experience providing technical support involving all aspects of audio visual, video conferencing, displays and presentations.\n\nOur contract / freelance roles would suit a seasoned freelancer looking for additional days/weeks work, or alternatively, someone in between jobs or out of work looking for a short to medium term solution.\n\nPlease note, actual day rates are dependant on specific site and experience/skill-set of workers.\n\nDesired AV Technician experience:\n• A strong understanding and operational knowledge... of video conferencing and audio-visual systems with the ability to diagnose and remedy any faults and problems.\n• Ensure all systems are fully functional and provide troubleshooting or handover to relevant personnel to allow minimum system down time.\n• Ability to adapt to various clients' needs and be able to fully integrate with multiple teams at short notice.\n• Experience in assisting and supporting internal and external high priority events and/or meeting room technology.\n• Good communication skills, both verbal and written, and the ability to communicate with all levels within an organisation. In2 Resourcing have decades of experience running temporary recruitment desks. We provide prompt weekly payment and full support with company formation or umbrella payroll set-up as well as contract compliance.\nThis job was originally posted as www.totaljobs.com/job/89814669"
  },
  {
    "": "Job Introduction BBC World News is the BBC's most watched TV channel - viewed by nearly 100 million people a week and available in more than 300 million households around the world.\nThe BBC has been committed to journalistic excellence for more than 80 years.\nBBC News aims to provide access to the information and ideas everyone needs to make sense of an increasingly complex world on whatever platform they chose.\nThrough its emphasis on specialist knowledge, international newsgathering and its breadth of programmes, BBC News seeks to deliver a complete news package, covering arts, science, sports, politics, business and world affairs.\nWith its team of 2,000 highly trained journalists and over 40 news bureaux, BBC News strives to bring impartial and trusted news reporting to audiences all over the globe.\nRole Responsibility We're creating a talent pool of producers on a freelance basis who we can contact to work with us at peak times.\nYou'll work effectively as part of the team within... BBC World News as directed on a variety of duties: writing and producing world news stories for TV using text, stills, video and graphics; gathering and working on information from various sources such as UGC and social media; writing headlines, structuring sequences and stories and working on OBs if required; contributing to the planning and origination of new angles and stories.\nAre you the right candidate? You will need a good knowledge of our editorial agenda, sharp production and writing skills and be able to respond to a fast-moving news environment.\nCandidates should enjoy working under pressure and bring plenty of story, contributor and production ideas to the role.\nYou will be expected to work across our platforms and have an understanding of the different production methods as well as audience needs.\nYou will be comfortable with technology and social media, able quickly to pick up new skills and turn ideas into engaging coverage.\nYou will need a thorough understanding of the BBC's editorial guidelines and values or the ability to pick this up quickly.\nAssessments are expected to take place in April 2020.\nThose successful after the Assessments will be invited to an interview.\nPlease note that you are required to complete a tailored application questionnaire as well as your CV.\nPlease keep to the word count for each of the questions were specified.\nPackage Description All opportunities offered, as a result of appointment to this talent pool, will be on a Freelance PAYE basis.\nAppointment to the Talent Pool will not entitle candidates to a permanent contract in the BBC, those will have to be applied for in the normal way, and neither does it guarantee work.\nHowever, it may lead to consideration for broader freelance opportunities across BBC News.\nAny freelance work offered will be carried out at our New Broadcasting House office in Portland Place, London, W1A 1AA.\nIf you already have a current staff contract with the BBC (continuing or fixed term), you won't be eligible to apply.\nAny work offered with the BBC will be conditional upon you having the right to work in the UK.\nAbout the BBC We don't focus simply on what we do - we also care how we do it.\nOur values and the way we behave are important to us.\nPlease make sure you've read about our values and behaviours in the document attached below.\nDiversity matters at the BBC.\nWe have a working environment where we value and respect every individual's unique contribution, enabling all of our employees to thrive and achieve their full potential.\nWe want to attract the broadest range of talented people to be part of the BBC - whether that's to contribute to our programming or our wide range of non-production roles.\nThe more diverse our workforce, the better able we are to respond to and reflect our audiences in all their diversity.\nWe are committed to equality of opportunity and welcome applications from individuals, regardless of age, gender, ethnicity, disability, sexual orientation, gender identity, socio-economic background, religion and/or belief.\nWe will consider flexible working requests for all roles, unless operational requirements prevent otherwise.\nTo find out more about Diversity and Inclusion at the BBC, please click here BBC"
  },
  {
    "": "Wedding ceremony and a couple of shots in the city afterwards.\n\nPlease ensure that your profile is complete with up-to-date examples of your work when applying and clear contact details."
  },
  {
    "": "SW - 007 - 1060\n\nFreelance Senior Account Manager / Account Director\n\nB2B / Corporate Comms\n\n£225 - £290 per day\n\n2 months\n\nCentral London\n\nHeadline of the Freelance Senior Account Manager / Account Director role\n\nMy client has an exciting opportunity for a creative Freelance Senior Account Manager / Account Director to join their dynamic and rapidly growing team. The role is for a 2-month period and will see you parachute into this global communications agency's London office. Operating in over 60 countries they are widely recognised as global leaders in integrated communications, having received a number of industry awards including 'Global Agency of the Year'.\n\nAbout the agency the Freelance Senior Account Manager / Account Director will be working with\n\nAs Freelance Senior Account Manager / Account Director you will be working with a diverse team of industry experts across B2B Corporate Communications. The agency are proud of their entrepreneurial, like- minded industry experts... and are looking for a PR superstar that will thrive in a collaborative and progressive working environment, based out of the agency's modern open plan EMEA HQ in the heart of London.\n\nKey aspects to the Freelance Senior Account Manager / Account Director role\n• Craft engaging purpose led content for the client's digital channels\n• Work closely with senior members in the account team to assist in the development and implementation of PR campaigns across EMEA to raise awareness of the clients' offering and products across key publications\n• Play a key role in activities including content creation, media relations, social media and digital PR and international events\n• Coordinate with teams across EMEA and gain high-profile coverage for exciting global campaigns\n• Work with the client's key stakeholders to help raise their profiles in the media through executive profiling\n• Engage with the media to create purpose led content and briefing documents\n\nKey skills of the ideal freelance Senior Account Manager / Account Director\n• Proven media relations practitioner with a track record of landing impactful coverage in some of the hardest to reach publications\n• Well-connected with the most influential UK and international business and trade media\n• Obsessed with news and cultural trends and how they can translate to your clients' audiences - through earned media and paid, owned and shared channels\n• Comfortable with providing strategic counsel to senior clients\n• Confident in measurement techniques to demonstrate the value of media relations and entrepreneurial in spotting client growth opportunities\n\nKey requirements of the Freelance Senior Account Manager / Account Director role\n• A strong desire to deliver exceptional corporate though led campaigns\n• Ability to build strong relationships\n• Tenacious, proactive and creative\n• Strong instinct for leadership and management\n• Ambitious and hungry to help grow the agency's offering\n• Hungry to win new business and able to spot opportunities\n• Available ASAP for Freelance\n• The Freelance Senior Account Manager / Account Director will receive a salary of between £225 to £290 depending on experience\n\nFor more information about the Freelance Senior Account Manager / Account Director role or to discuss any of our other vacancies send your CV now to Steve Woodward at stevew@reuben-sinclair.com or call 0203 826 1210"
  },
  {
    "": "Internationally renowned non-profit company in the Arts & Cultural sector. Based in London, they have an internal team of creatives and designers, but need help from specialists happy to be engaged on a project-by-project basis.\n\nAs a motion designer here you’ll be tasked to conceptualise ideas as storyboards and style frames, bringing them to life with creative animation techniques in 2D and 3D. You will largely work on your own projects but will be surrounded by likeminded individuals, all who have an open-and-share culture. Projects are diverse in size and scope from promotional and marketing videos, to titles and logo animations, to large screen led and projected animations, through to social media videos and other digital/interactive applications. All utilising your creative mind through Adobe CC and Cinema 4D.\n\nThis organisation seeks creative motion designers, who can demonstrate their ability in a showreel. They seek someone with conceptual and creative mind, who can animate... in innovative ways both in 2D and 3D. The skill to be the ‘art director’ of your own work, but also have the maturity to ask pertinent questions and receive feedback well. High proficiencies in Illustrator, After Effects, Cinema 4D, Photoshop and some skills in Premiere Pro too. Experience working in arts & culture projects will be advantageous, along with the understanding on such project types.\n\nThis organisation is open to applicants at all career levels. But ideally someone with the desired skillset, who wants to work in an arts & culture sector"
  },
  {
    "": "This company is a property maintenance provider in the UK covering London and South East England. This company generates a large volume of customer enquiries on a daily basis and has an excellent record for converting the majority of enquiries into confirmed appointments. They also work with several leading letting agents and property management companies...... click apply for full job details"
  },
  {
    "": "The role\n\nWorking with a multitude of varied luxury fashion clients, you will need to switch between copywriting styles fluidly and competently with a keen eye for detail. This role involves proofing all information which appears on the partnered brands’ sites and maintaining high levels of accuracy.\n\nEvery day will provide a new opportunity and the workload will become increasingly varied as the Black & White team expands its reach.\n\nFlexibility, tenacity and a collaborative attitude are essential for this new role. You will be experienced working in an environment which is fast-paced and deadline driven. Ideally this would have been within a sub-editing or proofreading role.\n\nWhat you'll do\n• Sub-edit and translate copy on both the CMS and live sites according to house style; working to tight daily deadlines to check accuracy of product copy against images as well grammar, spelling and formatting\n• Ensure all copy is clear, concise and localised where relevant\n• Check accuracy of... upload including product pages, user interface, technical copy (legal and transactional), creative copy (banners, email, SEO, newsletters) and click-through functionality\n• Developing tone of voice documents for our partnered brands\n• Work with our core copywriting team to ensure tone of voice is kept consistent across all languages\n• Maintain quality of content on product pages\n\nWho you are\n\nItalian mother tongue\n\nFluent in English\n• Expert knowledge of luxury fashion brands and products\n• You have an excellent writing style that is accurate, engaging and adaptable, with an impeccable use of grammar\n• Proven experience of digital translating, trans-creating and sub-editing\n• You have an understanding of garment and accessory construction\n• You have the ability to work independently\n• You have the ability to work quickly and to agreed daily targets and deadlines with a keen eye for detail\n• You are comfortable with digital work on an in-house CMS"
  },
  {
    "": "Job Title: Lingerie Pattern Cutter\n\nPosition: Mid/senior level freelancer\n\nPay: £4,000 for project\n\nLocation: Hackney Wick, East London and/or remote working.\n\nStart date: Immediate\n\nProject duration: 8-12 weeks\n\nAbout Lara Intimates\n\nLara Intimates is a start-up women’s underwear brand making every product from sustainably sourced textiles in our all-female lingerie factory in Hackney Wick. Lara also offers one of the widest bra size ranges in the world. Our business exists to celebrate women from design to production and customer experience.\n\nLara Intimates has been in business for 2.5 years. The team is 7 women currently, and we are excited to grow much bigger in the coming year. This is a great opportunity to be a part of a small, growing team and build a rewarding career with growth and longevity.\n\nJob Opportunity: Lingerie Pattern Cutter\n\nWe have an exciting opportunity for a freelance lingerie pattern cutter to work with our team.\n\nTwo of our best-selling bra styles exist in... paper patterns only. Your job will be to redevelop these patterns digitally on Vetigraph software (https://fashiondigitalsolutions.co.uk/). You will develop patterns for two bra styles in the full size range and work with our team to fit test and approve all sizes across the range.\n\nWe will provide you with product designs, pattern cutting software, computer and software training where necessary. (Experience using Vetigraph is preferred but not required.)\n\nBenefits of Working with Lara Intimates\n• Happy, positive and communicative company culture\n• Innovative lingerie company with a sustainable and ethical mission\n• Fast growing lingerie company with potential for more freelance or full-time work in the future\n• Lara Intimates designs, samples, fit tests and manufactures in-house. This allows us to be hands-on and fast when developing new products.\n• Be a foundational part of our team now and in the future\n\nMain Duties & Responsibilities\n• Redevelop two bras styles from paper patterns to digital patterns on Vetigraph software\n• Create a critical path for the project, and complete work accordingly.\n• Communicate regularly with our team to ensure efficiency throughout the project\n• Execute a perfect fit across all sizes and consistency of fit across all products\n\nThe Ideal Candidate:\n• Lingerie pattern cutting experience - digital preferred (Vetigraph, Gerber, Lectra)\n• Has a positive attitude and is a team player\n• Is a good listener and takes feedback well\n• Manages timelines and critical path well\n• Diligent in finishing products to a high standard\n• Interested in Lara Intimates brand and potential\n\nHow to Apply\n\nPlease submit the following to team@laraintimates.com:\n• CV\n• 2-3 references with contact by phone\n• Cover letter including:\n• Your relevant experience\n• Why are you interested in this position?\n• What kinds of products have you made patterns for?\n• What is the widest size range you have made patterns for?\n• Your availability\n\nLearn more about Lara Intimates:\n\nhttps://laraintimates.com/\n\nhttps://www.instagram.com/laraintimates"
  },
  {
    "": "Become an In2 Freelancer!\n\nWe have seen a recent increase in the number of requests for flexible short-term cover and long-term 3, 6 or 12 months contract assignments with our AV clientele.\n\nWe are actively seeking freelance/contract AV/VC Technicians across the whole of the UK to work on-site at Financial institutions and large corporate customer sites covering the busy summer period.\n\nSuitable candidates will be available for a quick start and have customer facing, corporate experience providing technical support involving all aspects of audio visual, video conferencing, displays and presentations.\n\nOur contract / freelance roles would suit a seasoned freelancer looking for additional days/weeks work, or alternatively, someone in between jobs or out of work looking for a short to medium term solution.\n\nPlease note, actual day rates are dependant on specific site and experience/skill-set of workers.\n\nDesired AV Technician experience:\n\nA strong understanding and operational knowledge... of video conferencing and audio-visual systems with the ability to diagnose and remedy any faults and problems.\nEnsure all systems are fully functional and provide troubleshooting or handover to relevant personnel to allow minimum system down time.\nAbility to adapt to various clients’ needs and be able to fully integrate with multiple teams at short notice.\nExperience in assisting and supporting internal and external high priority events and/or meeting room technology.\nGood communication skills, both verbal and written, and the ability to communicate with all levels within an organisation. In2 Resourcing have decades of experience running temporary recruitment desks. We provide prompt weekly payment and full support with company formation or umbrella payroll set-up as well as contract compliance"
  },
  {
    "": "Job Profile Teaching - Project Supervisor\n\nContract Type Freelance\n\nJob Purpose\n\nBPP School of Business and Technology is recruiting for a number of associate faculty roles to accommodate the demand needs within the school to supervise student work-based and professional projects, supporting learners in working towards their Digital Degree Apprenticeship.\n\nWe are looking for highly motivated, practitioner-experienced lecturers to bring high quality project supervision into the School.\n\nPractitioner areas of experience and specialist knowledge relevant to these programmes would include:\n• Business Analyst\n• Cyber Security Analyst\n• Data Analyst\n• IT consultancy\n• Network Engineer\n• Software Engineer/Developer\n\nJob Background\n\nThe role is essential in providing further support for individual students over and above their weekly seminar contact with their Module Leader, on a one-to-one basis. This is towards the completion of two consecutive projects that are undertaken towards the... successful completion of their Degree Apprenticeship in Digital Technology Solutions (DTS). The projects are:\n• Work-based project (Level 5)\n• Professional project (Level 6)\n\nKey Responsibilities:\n• To provide clear guidance and support to students who are writing projects in your specialist area/s. Contact and support will be provided over two consecutive semesters, for each project supervised.\n• To liaise with the student's line manager over the setting and progress of the project\n\nCoordination and communication between student, line manager and yourself can be conducted through a range of possible remote channels, including email, Skype or telephone.\n\nYou may be offered to supervise a number of students simultaneously, subject to your availability and suitability.\n\nDepartment School of Business and Technology - SOBAT Faculty\n\nVacancy location\n\nLocation UK, Nationwide, Nationwide\n\nCandidate Criteria\n\nEssential\n• Relevant first degree and/or Professional Qualification(s) applicable to your subject area and level of teaching\n• Significant Practitioner experience and/or applied research relevant to the discipline\n• Experience of negotiation with and managing different stakeholders\n• Excellent written and verbal communication skills\n• The ability to effectively plan, organise and prioritise workload\n• The ability to work well in a team and be collaborative\n• Excellent computer/IT skills\n• Self-motivated\n• Commercially and educationally focused with leadership and coaching skills\n\nPlease note successful candidates will be required to undergo a DBS check\n\nDesirable\n• A teaching qualification relevant to the discipline or Fellowship of the HEA or a commitment to achieving either of these through BPP's PGCPHE (Post Graduate Certificate in Professional Higher Education) or Headway, BPP's accredited CPD scheme BCS registration\n• Other industry related professional accreditations and/or certifications (i.e. A+, BCS Systems Development Essentials, CompTIA, Cisco, ITIL, Linux, MTA and Network+)\n• Experience of teaching Digital subjects at a Further (Level 3) and/or Higher (Levels 4-6) education level\n• Experience in teaching live on line and/or of delivering training and seminars in a commercial context, relevant to the Digital sector\n• Experience/awareness of delivery needs for work based learners\n• Experience of supporting students in an academic context\n\nEmployment Details\n\nContract Hours Freelance\n\nFTE Freelance\n\nSalary Competitive\n\nAttachments\n\nFull Job Description\n\nDTS Project Supervisors Job Description.pdf (313 Kb"
  },
  {
    "": "SITE MANAGER\nLOCATION: LONDON\nSALARY: £(Apply online only) per day\n\nCapstone Recruitment are currently working with a construction company on the refurbishment of a theatre in London. This is a large multi-million pound refurbishment and due to complete within 4 months.\n\nSite Managers\n\nSite based, 8am to 6pm, plus weekend as required.\nSMSTS and first aid qualified with 10 years UK experience.\nExperience with heritage buildings\nExperience in Construction Management preferred.\nKnowledge of JCT form of contract\nExperienced with Microsoft Outlook, Excel, Powerpoint and Word. Good standard of written English including basic report writing.\nMust provide own Windows laptop and mobile phone for business use.\n\nJob Description\nSite based role monitoring all construction HS, progress and quality aspects of a the works.\nThe role will be reporting directly to the Construction Manager whilst working closely with large multidisciplinary team.\nDuties will include;\n\nRecord keeping and reporting of the... construction process\nLiaison with all contractors on site\nSolving logistic and co-ordination issues.\nCo-ordination with the Theatre and Design Teams\nChairing and recording progress and co-ordination meetings\nDevelopment and close monitoring of detailed work programmes and schedules.\nAssessment of RAMS and monitoring of implementation.\nPreparation of weekly progress reports including photos and programme drop lines\n\nIf you're interested, please get in touch below:\n(phone number removed)\n(phone number removed)\n(url removed)\n\nTransparency Notice to Prospective Candidates\n\nWe process certain personal information about you for our legitimate business interests in order to identify and contact suitable candidates about positions that may be relevant to them. At Capstone Property Recruitment Ltd we respect your Privacy details all of which are set out in our Privacy Policy on our website at (url removed) .If you don't want to be contacted by us about potential positions that may be of interest to you in the future, then please email our Data Protection Officer at\nRole: Freelance Site Manager\nJob Type: Temporary\nLocation: London, London,\n\nApply for this job now"
  },
  {
    "": "A great freelance opportunity to support stores with local marketing and this brand during a busy time. Read on! Freelance Marketing Executive - Up to £30,000 - 12 week contract - London THE COMPANY Self storage for consumers & businesses, based in Mayfair THE ROLE Within the role of Marketing Executive your will be responsible for: - Supporting stores with local marketing & initiatives - Working with inhouse designers to develop promotional material - Ensuring all POS & signage is on brand and correct - Owning the customer feedback programme - Liaising with customers online - Supporting launch of new stores YOU In order to apply for the role of Marketing Executive you must: - Be free immediately - Ideally have experience of working with a retail environment - Have excellent communication skills & strong written word - Be highly organised - Be able to work autonomously If this sounds like the role for you, apply now! Freelance Marketing Executive - Up to £30,000 - 12 week contract ... London If this role isn't what you're looking for don't worry. At Stopgap we cover all permanent and freelance marketing positions, with specialist industry sector teams. You can check out all of our roles on our website and sign up for job alerts so you're the first to know about a new opportunity . Marketing Recruitment - The Stopgap Way"
  },
  {
    "": "We are looking for a Podcast Producer/Editor to manage the creation and production of Ink original podcasts.\n\nAbout Ink\n\nInk is the global leader in travel media, producing award-winning bespoke content for more than 20 airlines and travel groups around the world. We have offices in London, Singapore, New York and Miami. Along with print, video and digital, Ink is moving into podcasting as an additional creative medium to further expand its content offer. We are currently looking for a Podcast Producer/Editor to join the company, and oversee and action the creation of Ink original podcasts.\n\nWe are looking for a multi-skilled, creative person, who has previous experience in producing podcasts. This is an exciting opportunity for someone who is good at ideation, and coming up with original concepts and engaging formats, but also has the organisational skills and personality to be able to put the production wheels in motion as well as see the podcasts through to completion in an edit... If you love great storytelling, and are passionate about travel and podcasting, then please get in touch.\n\nSkills required\n• Previous producing experience of podcasts\n• Editing experience with podcasts\n• Great script writing skills\n• Technical understanding of audio recording equipment.\n• A creative mindset, always thinking of ideas\n• Leadership skills, we are looking for someone to take charge of the formats and ideas, and feel comfortable in being the point person for podcasting.\n• Understanding of engaging storytelling\n• Experience with Adobe Audition, iZotope RX7 Advancedm and Pro Tools or Logic Pro X is preferrable\n\nHow to apply\n\nPlease send a CV, cover letter and some examples of previous podcast work"
  },
  {
    "": "Freelance Fire Risk Assessor\n\nFire Risk Assessor | Freelance | Fire Service | Part Time or Full Time | IFE | Commercial | Residential\n\nA Rapidly growing Health and Safety Consultancy in the Birmingham and London is looking for a Fire Risk Assessor experienced in commercial and residential sectors. This role could be done on a part time or ad hoc basis. My client would encourage applications from Ex-Fire Service individuals.\n\nThe role of the Fire Risk Assessor:\n\nYou will be working with Public and Private Sector clients\nTo deliver Fire Risk Assessments as part of our Safety Management team\nAttending client meetings, on-site meetings and design team meetings\nDesign and drawing appraisals\nOn Site Advisory The Successful Fire Risk Assessor:\n\nMIFireE membership is essential\nExperience with Residential and Commercial Assessments, Types 1-4\nExperience with Passive fire protection surveys\nMinimum of 2 years' experienceResponsibilities of the Fire Risk Assessor:\n\nProvide help, assessment and... advice of issues including:\nFire safety management; passive and active fire safety systems; fire doors and escape routes, firefighting lifts; emergency lighting, fire hydrants, fire alarms, sprinklers and firefighting equipment, specialist fire protection systems and end user Fire SafetyRole: Fire Assessor\n\nLocation: Birmingham\n\nSectors: Residential and Commercial\n\nDay Rate: £DOE\n\nIf you are a Fire Risk Assessor and match the description above, please get in contact with Sam Hughes at Brandon James.\n\nRef: SH8401\n\n(phone number removed"
  },
  {
    "": "££££ PAID ROLE ££££\n\nLooking for a videographer based in either Manchester or London for a video campaign about circular economy and sustainable innovations.\n\nInterest and basic knowledge in the below would be a bonus but not mandatory:\nSustainability\nEthical practices\nTextiles/fashion industry\nCircular economy\n\nMust have your own equipment and be able to travel early April, incl. a potential trip abroad to Europe (travel and accommodation paid for in addition to videographer fee) with a quick turnaround for end of April (w/c 20th).\n\nIf interested, please send an email to emma [at] emmablakemorsi [dot] co [dot] uk with a link to your portfolio/showreel by Monday 16th March and more details will be provided.\n\nPlease share with your networks."
  },
  {
    "": "SITE MANAGER\nLOCATION: LONDON\nSALARY: £(Apply online only) per day\n\nCapstone Recruitment are currently working with a construction company on the refurbishment of a theatre in London. This is a large multi-million pound refurbishment and due to complete within 4 months.\n\nSite Managers\n\nSite based, 8am to 6pm, plus weekend as required.\nSMSTS and first aid qualified with 10 years UK experience.\nExperience with heritage buildings\nExperience in Construction Management preferred.\nKnowledge of JCT form of contract\nExperienced with Microsoft Outlook, Excel, Powerpoint and Word. Good standard of written English including basic report writing.\nMust provide own Windows laptop and mobile phone for business use.\n\nJob Description\nSite based role monitoring all construction H&S, progress and quality aspects of a the works.\nThe role will be reporting directly to the Construction Manager whilst working closely with large multidisciplinary team.\nDuties will include;\n\nRecord keeping and reporting of... the construction process\nLiaison with all contractors on site\nSolving logistic and co-ordination issues.\nCo-ordination with the Theatre and Design Teams\nChairing and recording progress and co-ordination meetings\nDevelopment and close monitoring of detailed work programmes and schedules.\nAssessment of RAMS and monitoring of implementation.\nPreparation of weekly progress reports including photos and programme drop lines\n\nIf you're interested, please get in touch below:\n(phone number removed)\n(phone number removed)\n(url removed)\n\nTransparency Notice to Prospective Candidates\n\nWe process certain personal information about you for our legitimate business interests in order to identify and contact suitable candidates about positions that may be relevant to them. At Capstone Property Recruitment Ltd we respect your Privacy details all of which are set out in our Privacy Policy on our website at (url removed) .If you don't want to be contacted by us about potential positions that may be of interest to you in the future, then please email our Data Protection Officer at"
  },
  {
    "": "Freelance Social Media Executive, Education Industry, London - Start ASAP\n\nAbout the Role\n\nThis is a rare opportunity to join a household name in the Education industry looking for a freelance Social Media Executive. The role is a key position within the Social Media Team who will be responsible for the Community Management for their diverse online community with your work being seen across the nation! You will be someone who has been working in Social for the past 3 years and understand the modern world and have a natural feel for the industry and how to get the best for the company. The successful candidate will be one who likes to challenge the norm and are trying new things to grab the attention of the target audience.\n\nWe are looking for someone who can start immediately and has the ideas but also the passion to work with the Marketing team to increase engagement across a variety of social media channels. You will strive to improve yourself and your methods and take advantage of... a working environment where you will be surrounded by the best in the business.\n\nAbout the company\n\nOur Client is a leading Educational company that is recognised globally. With an environment that encourages personal growth this is a unique opportunity for employees to benefit from time given to training to improve skills sets for the benefit of the individual and the company as a whole. My client has a reputation for keeping employees happy and challenged throughout their career including offering an unrivalled benefits package"
  },
  {
    "": "As part of our plans to grow the business and deploy a range of exciting new products and services we are looking to hire a freelance Full stack Developer. Based in London, you will be responsible for the development of a full range of Bagboard products on iOS platforms.\n\nResponsibilities\n\n- Able to understand user stories and requirements and develop software solutions\n\n- Capable to design, code and test software code for SWIFT, PHP, running on AWS and SQL data bases\n\n- Hand over completed modules of code to QA/testing in expected timeframe and with the expected quality\n\n- Use GitHub to manage and control software code versions and advise and manage other developers in the use of repositories and build tools/environment.\n\n- Use confluence to document the design of the software being built\n\n- Use JIRA to track work packages through from backlog to in-progress to QA and DONE\n\n- Keep up to date with latest technology trends\n\n- Able to work with legacy code and familiar with code debt... reduction.\n• Based in Southwark, London\n\nRequirements\n\n- University degree in Computer Science or related field\n\n- Excellent knowledge of SWIFT, PHP, SQL and the AWS environment.\n\n- Experience in SCRUM and Agile development methods\n\n- Experience with live production deployments and staging environments\n\n- Excellent communication skills and team player\n\n- Passion for sustainability or awareness of the conditions that face our planet"
  },
  {
    "": "A leading Letting and Sales Agency in London has an exciting opportunity for a Freelance Property Photographer to join their team.\n\nWith international offices in China, Hong Kong, India, Malaysia and Singapore, they are fast-growing and are looking for a Photographer to take pictures of their London properties.\n\nResponsibilities:\n• Visiting properties across London to take photographs\n• Producing floor plan sketches, and filming short videos of the properties\n• Liaising with Estate Agents and their vendors to arrange appointments to visit the properties or to collect keys\n• Uploading your files to the company's internal drive the same day or the next day after the appointments\n\nHours: Freelance, 8-16 hours per week\n\nSalary: £100 per day depending on experience.\n\nTransport: You will need to be able to pay for your own transport\n\nRequirements:\n• 1+ year's experience in property photography\n• Confidence and organisation skills\n• Ability to manage time effectively\n• Confident, well spoken... English and excellent communication skills\n• Experience in sketching floor plan or video will be a plus.\n\nEquipment needed:\n• Full frame camera\n• Wide angle lens (eg: 16-35mm)\n• Flash\n• Tripod\n• Photo editing software (eg: Lightroom/Photoshop).\n\nSounds interesting? Click the APPLY button now.\n\nPlease include 10-15 images of your property photography work in your portfolio. Please include links to your portfolio in your CV.\n\nCandidates with previous experience in or job titles including: Freelance Photographer, Photography, Freelance Property Photographer, Videographer, may be considered"
  },
  {
    "": "Short photography session for engagement proposal in Porto. Hopefully discreet, so to take photos when I arrive there with my girlfriend to take a few photos of the proposal itself and afterwards (1-2 hours)."
  },
  {
    "": "Freelancer.com is the world's largest freelancing and crowdsourcing marketplace, which connects millions of employers to freelancers across the globe.\n\nWe think it is pretty cool that our marketplace hosts a real life economy, where work is undertaken in every area you can think of. From design, writing, data entry and software development; through to sales, marketing, accounting and legal services - even NASA uses us!\n\nWe are looking for fullstack software engineers. Our team work with the latest tech, and push code 30-40 times a day in a high-performance cloud environment. We develop core, revenue-generating products, and so this represents an opportunity to have a fundamental impact on our global business.\n\nNot only will you build features and software that scale, but your work will have direct impact on tens of millions of users worldwide. So if you excel at architecting web applications at scale, enjoy the challenge of writing optimised lightning fast SQL for massive data sets... have experience structuring extensible data and application logic, and are passionate about designing high quality APIs, then we'd love to hear from you!\n\nMultiple positions available, ranging from junior (graduate) to mid-range and senior positions.\n\nRequirements\n• Proficiency in a web development language, such as Python, Golang, PHP or Ruby\n• Experience with Javascript, preferably Angular, TypeScript, ES6 or other common JS frameworks\n• Experience with relational databases and SQL, preferably MySQL\n• Linux experience\n• Background or interest in web engineering at scale\n• Ideally, a Github page with contributions to open source software\n• Bachelors Degree in Computer Science / Engineering (or related); MS or PhD a plus\n\nBenefits\n\nThis won’t be a cog-in-the-machine type of job; you will be joining a global company that values attitude and capability over experience, so if you are looking to make a difference and be rewarded for your efforts, this is the place for you.\n\nWe are striving to shape the future of work, so help us scale to 100+ million users, while enjoying all the perks of working in tech.\n\nWe offer:\n• Competitive salary\n• Pension scheme\n• Regular appraisals and personal development plans\n• Relaxed dress code\n• Centrally located office with a fully-stocked kitchen and bar\n• Fun atmosphere, working with smart people\n• Transparent communication and no bureaucracy\n• Weekly team lunches\n• Regular paid social events, hackathons, and more\n\nFor more information see www.freelancer.com/careers"
  },
  {
    "": "Onset (Independent Short Film)\n\nMain Duties\n\nSearching for a gaffer to collaborate with on a horror film with an emotional, soul-searching twist. The dialogue is minimal and weighted - the visuals are visceral and striking. The most interesting scenes to shoot will be the scenes that represent a nightmare creeping into the main character's life. We have a talented actor on board to play the lead role (he was most recently in Les Miserables with Michael Ball) and, as a trailer editor myself, I have connections within the post-production industry for grading/mixing/VFX.\n\nSkills and Experience\n\nLighting and gaffer experience required\n\nAccess to kit needed"
  },
  {
    "": "AC-1465951670 Miscellaneous 0 London Permanent 13th Mar A great freelance opportunity to support stores with local marketing and this brand during a busy time\n\nRead on Freelance Marketing Executive - Up to £30,000 - 12 week contract - London THE COMPANY Self storage for consumers and businesses, based in Mayfair THE ROLE Within the role of Marketing Executive your will be responsible for: - Supporting stores with local marketing and initiatives - Working with inhouse designers to develop promotional material - Ensuring all POS and signage is on brand and correct - Owning the customer feedback programme - Liaising with customers online - Supporting launch of new stores YOU In order to apply for the role of Marketing Executive you must: - Be free immediately - Ideally have experience of working with a retail environment - Have excellent communication skills and strong written word - Be highly organised - Be able to work autonomously If this sounds like the role for you, apply now... Freelance Marketing Executive - Up to £30,000 - 12 week contract - London If this role isn''t what you''re looking for don''t worry\n\nAt Stopgap we cover all permanent and freelance marketing positions, with specialist industry sector teams\n\nYou can check out all of our roles on our website and sign up for job alerts so you''re the first to know about a new opportunity\n\nMarketing Recruitment - The Stopgap Way"
  },
  {
    "": "Are you eager to shape employee and customer experience for some of the world’s brightest brands?\n\nWant to work with a diverse team of researchers, strategists, and designers working on exciting challenges across industries?\n\nSutherland Labs is an experience design agency with offices in London and San Francisco.\n\nWe meld research, strategy, and design to create solutions that not only grow businesses, but also enhance everyday lives.\n\nWe’re a culture of curious thinkers who collaborate in a hands-on environment where taking a different perspective is paramount.\n\nWe are currently looking for freelance researchers to work on upcoming projects of 2-3 months, that require some travel to different countries.\n\nKey Responsibilities\n\nWork with our research teams to support user experience projects, conducting user research, field studies, usability testing and other activities\n\nSupport the creation of journey maps, personas and other means of visual communication to bring research insights... to life\n\nEducation and Experience\n\nAt least undergraduate degree in Design, User Experience, Human-Computer Interaction, or a related field.\n\nIn lieu of degree, relevant skills or equivalent experience.\n\n1-3 years of research experience within the User Experience and/or Design in a commercial environment\n\nAn understanding and demonstration of user-centered design principles.\n\nStrong written and communication skills\n\nJob Requirements\n\nEligibility to work in the UK without sponsorship\n\nGlobal and domestic travel is required\n\nWhile scope of these projects is global, planning, analysis and other collaborative activities will take place in our London Labs.\n\nFreelance researchers must therefore be available and able to travel to and work in London.\n\nData Protection\n\nAt Sutherland we take protecting your privacy seriously and will not use any Personal Data submitted as part of your job application outside of the requirements of the recruitment process.\n\nBy submitting this application you agree to allow us to process your Personal Data for the purposes of recruitment"
  },
  {
    "": "A leading luxury fashion brand is looking for Freelance Production Coordinator to join their content team.\n\nWorking within the production team, this role is essential for ensuring that all content is delivered on time and deadlines are met.\n\nWe are looking for someone with strong project management, production or traffic management experience within a fashion environment...... click apply for full job details"
  },
  {
    "": "Are you a PPC manager looking for a new exciting position with a globally recognised agency in a hands-on role?\n\nThis role gives you the opportunity to showcase your knowledge and skills in ad campaigns, analysing data / trends and showcasing your enthusiasm in an open, modern office space.\n\nAs a driven PPC manager you will have the ability to work with a variety of projects for an industry-leading agency that offers access to the best tools on the market, analysing trends and results whilst showcasing your creative thinking and strategy skills.\n\nThe Role:\n• Using expertise in PPC Paid Search tactics you will be given the opportunity to create and plan a variety of campaigns across a variety of paid channels such as Google and Bing\n• Flexible and adaptable, you will be able to thrive in an environment with a broad range of responsibilities, managing a number of campaigns, giving you lots of variety in your role\n• This is a fantastic chance to work with exceptional talent, and add... value to the business to ensure continued success\n\nThe Person:\n• Showcasing your excellent knowledge of analytic tools such as Google Analytics, AdWords, Facebook Ads and Google Adwords to optimise these exciting campaigns\n• With a successful background in PPC (agency side) you will be managing PPC accounts in a hands-on role, analysing trends and making decisions based on that data\n• Activating campaigns to contribute to client success and increase performance of the accounts, increasing the reputation of the market with your work\n\nIf this exciting, immediate start opportunity looks like the role for you, apply now!\nHannah Copp\nTalent Consultant\nwww.linkedin.com/in/hannah-copp-072b23169/\n\nThis job was originally posted as www.totaljobs.com/job/89771972"
  },
  {
    "": "International production & post company already established in London are now expanding. Their clients love what they do and want more!\n\nThey seek an experienced Offline Video Editor to collaborate with them on a project-by-project basis. Ideal candidate will be a freelance Video Editor with a showreel or vimeo page exhibiting abilities in editing short form films; branded content / promos / social videos / commercials / music videos / short documentary’s, all in Adobe Premiere Pro.\n\nFor this company it’s important to have an Editor with the client facing experience in order to sit in a room with and take direct feedback/consult and advise. Someone with the maturity to ask appropriate questions in a professional manner to extract the information you need. Someone who is able to apply creativity and craft yet have a clear efficient method in place.\n\nIn addition, language skills will also prove immensely beneficial. For example, Mandarin or Japanese or Thai, Arabic or German or Spanish... or French. If you do poses fluency (verbal and written) in any second language, we would love to hear from you"
  },
  {
    "": "My client is an instantly recognisable retail brand who is looking for a Freelance Junior Copywriter to support them during their busy time for a 3 month contract\n\nThe Freelance Junior Copywriter will be working within the company’s creative studio alongside a team of designers, artworkers and copywriters so this is a great opportunity for them to developer their own skills. They will be responsible for producing product descriptions for the brands ecommerce site. Ideally the Freelance Junior Copywriter will have work experience within other another retail brand or an agency. It is really important that you feel confident working quickly as this is a fast turnaournd environment.\n\nThe Freelance Junior Copywriter will have the opportunity to work for a very well known brand, you must be able to get onsite in Liverpool.\n\nPlease apply today with your CV and portfolio.\n\nProfiles Creative work with the most talented people across Design & Creative, Digital & Ecommerce, Social & Content... Marketing & Communications and PR & Client Services, partnering with the most innovative agencies, as well as top fashion houses, luxury brands, global retailers, media companies and cutting edge travel & leisure companies. We recruit comprehensively for permanent, contract, and freelance candidates at all levels throughout the UK and internationally.\n\nProfiles Creative is acting as an Employment Business in relation to this vacancy"
  },
  {
    "": "Talented freelance Account Manager / Account Director needed for my client based in central London. We are looking for someone to work for their consumer healthcare team, you must be able to start ASAP for 12 weeks+ contract.\n\nOne does not require oncology experience – BUT it’s essential that you have a good healthcare background and some great global and national media relations.\n\nYou will be support new business, drive media coverage and craft high quality content. You will need to hit the ground running and will support multiple clients from the offset. You will be supporting a great team on new business and marketing efforts to continue growth.\n\nDay to day will involve, but not limited to:\n\n- Pitching stories to journalists, drafting press releases and bylines\n- Developing media target lists\n- Creating key press materials\n- Providing and reporting analysis for campaign activities\n- Drafting client proposals\n- Supporting campaign and programme development.\n\nVisit our website... media-contacts.co.uk to see other vacancies we are currently recruiting for"
  },
  {
    "": "We are looking for organised, technically-minded and confident new freelance team members to work both remotely and in our London office as part of our live webinar department. The Freelance Webinar Coordinator will be managing webinars utilising the BrightTALK™ platform.\n\nExperience, qualification, and soft skills - have you got everything required to succeed in this opportunity? Find out below.\nThis position is contracted on an as-needed basis. Some work outside of business hours will be required and applicants will be asked to train or work from BrightTALK’s offices. Ideally, candidates will have consistent availability over the next four to six months and will be flexible with regard to working remotely or in office. Candidates with broad availability will be viewed favourably.\nPrimary responsibilities include managing audio webinars via the BrightTALK platform, managing video broadcasts using Telestream’s Wirecast encoding and streaming software, responding immediately to... scheduling requests, and communicating quickly and accurately with the team.\nThe ideal candidate is reliable, well-spoken and demonstrates a professional demeanour.\nAll remote webinars will be web based and will require the use of a phone. To facilitate working remotely, the candidate must have access to a reliable internet connection and Mac or Windows PC, landline phone and quiet working environment.Role will include\n• * Execution of live audio and video webinars, including client management\n• Covering event bookings as necessary, including those outside of business hours\n• Maintaining fast and accurate communication\nExperience Required\n• * Live audio production for web, radio or teleconference\n• Experience with web-based content management systems\n• Excellent writing skills and good attention to detail\n• Bachelor's degree or equivalent with at least 2 years of professional experience\nUseful skills\n• * Experience with video and audio production\n• Experience with audio production or post-production\n• Experience managing conference calls and/or moderating live events\n\nPlease email a copy of your resume with a cover letter including the following:Relevant professional experienceYour preference with regard to working remotely or in officeDays you are unavailable for work"
  },
  {
    "": "I have been briefed on a Freelance Graphics Designer (Fashion) for Womenswear and Older Girls. The ideal candidate will have come from a branded or retail background for a trend lead business.\n\nThis role is to start ASAP and will be supporting across all live projects, and assisting with initial research, mood, fabrications, muse and trend development, and will look at how these translate to the current briefs the team are working on.\n\nYou will work across style guides, trend packs and create graphics for all product categories.\n\nYou will have a good understanding of women's trends and will have a sportswear lead handwriting.\n\nThis role is to start asap and is full time hours."
  },
  {
    "": "A fantastic new opportunity for a Freelance Community Manager to join a leading creative agency to work on an FMCG client portfolio. As The Freelance Community Manager you will be working with the developing and producing the best social content for some incredible food and drink brands.\nStart date, immediate and 9 month project.\n\nThe Freelance Community Manager Will Be\n\nDelivering social strategy, creative ideas and producing content, all informed by data and deployed in collaboration with media planning.\nContent Creator and Campaigns Lead, with whom they will brainstorm ideas, manage channels, and output content to a high creative standard at all times.\nCreating content calendars\nThe voice of the brand on social channels.\n\nThe Freelance Community Manager Will Have\n\nExperience being a key user of Hootsuite (and TalkWalker) or other social media platforms\nExperience working with consumer or food and drink brands\nExperience creating content in line with tone of voice and brand... guidelines #\nProven experience increasing traffic across multiple channels (Twitter, Facebook, LinkedIn, Instagram)\nIf this role is of interest, please apply or email There are interview slots for Tuesday 10th and Wednesday 11th March and the client is looking to make a decision before the end of WC 9th March"
  },
  {
    "": "Job DescriptionThis is an exciting freelance opportunity with a friendly team for someone still training in Computer Science and looking to widen their repertoire at a digital company.\n\nBe one of the first applicants - read the complete overview of the role below, then send your application for consideration.\n\nYou'll be overseeing project management and delivery of technical projects and making a difference to the company's business practices.\n\nPerfect if you want relevant work experience at a young start-up company where you can make this role your own.\n\nWith us, change is embraced, development encouraged and your opinion matters when it concerns improving our services to clients.\n\nThis job will see you liaising with developers on projects, getting sites live and overseeing bug fixing, whilst applying your technical knowledge to advise on project builds.\n\nYou will be required to be flexible and independent in thinking.\n\nAn interest in marketing is helpful.\n\nAnd it doesn't matter... where you are, with us, you can work from almost anywhere.\n\nWe're looking for:\n• A natural problem solver\n• Someone with project management experience (if you've managed projects in your studies that counts)\n• Someone great with clients\n• Someone who works independently without micro management If this is you, then we'd love to hear from you.\n\nFresh talent is important to us We recognise that we must have fresh talent in the company to keep stay competitive and relevant.\n\nWe're looking for technical minds at the forefront of the latest in Computer Science who might still be in training to bring new ideas and apply their theory to our processes, to ensure we're delivering in the best way possible to our clients technical requirements.\n\nHours and terms 5-8 hours are all that is needed for now, but this could change as the company grows.\n\nThe working hours are completely flexible with attendance of fortnightly online meetings the only fixed requirement.\n\nThe role is also remote allowing you to work from any location.\n\nThe role will initially be a trial period, reviewed every month for the first 2-3 months, but could be ongoing depending on the scope of the work.\n\nFor the right person, there is potential for a long term professional relationship with greater responsibilities and benefits.\n\nResponsibilities include:\n• Being the point of contact to assist with internal technical problems.\n• Propose and introduce new systems and technical processes to improve operational efficiency.\n• Take technical responsibility for the management of new site go lives.\n\nLiaising with development where necessary.\n• Assist with technical direction in meetings with clients and internally where necessary.\n• Assist with web design solutions where necessary.\n• Project managing and overseeing our offshore development team, ensuring developer estimates are reasonable, development work is completed to specification, on time and within budget (potential).\n• Assist with release testing either through regression or unit testing tools or through designing appropriate UAT tests.\n\nProvide technical sign off for releases.\n• Ensure the quality of the development work is up to standard required by the client.\n\nEnsure quality gates agreed.\n• Ensure our internal agile project management systems are properly utilised reflected in JIRA or other agile working tool so tracking the effort is possible.\n• Carrying out regular reporting to the team during various phases of a project, so communications can be maintained with clients throughout the progress of the project.\n\nThis will include cost and time estimates, work completion reports, testing, bugs, go lives or any other aspects of the project as it progresses.\n• Analytical reporting as and when required: this could include google analytics, social media reach, facebook adverts and similar tools (potential).\n• Perform a development role where required and appropriate for inhouse tools or client platforms.\n\nSkills required\n• Computer Science or similar A Level and starting or undertaking currently an undergraduate Computer Science degree.\n• Fundamental understanding of programming principles and or an understanding of one high level programming language.\n• Familiarity with web based languages and technologies.\n• Understanding of code repositories, build tools, continuous integration.\n• Familiarity with the latest developments in web design.\n• An understanding of UX and standard practices in web design.\n• Excellent interpersonal and relationship building skills.\n• An ability to explain complex technical problems in non-technical terms.\n\nDesirable\n• Familiarity with PHP and Laravel\n• Familiarity with app development processes and practices.\n• Familiarity with technical marketing tools like Google Webmaster Tools, Facebook ads manager, Infusionsoft, Mailchimp etc.\n• Some creative web design experience.\n• Familiarity with wordpress key functionality and code.\n\nAbout the company Phlashweb is a new web platform and marketing business that prides itself in providing bespoke technical solutions to our clients in a way that truly meets their needs.\n\nWe're proud of our speed and efficiency in servin"
  },
  {
    "": "Morgan King Environmental - Asbestos Analyst - Central London - 10th March - 26th April\nWe are looking for a Asbestos Analyst in the Central London Area, working on static sites.\n\nDuties Will Include\n• Air Testing\n• Personal\n• Leaks\n• Full Clearances\nWorking 7 days a week\nMust have P403 & P404\nPlease call Lauren on (phone number removed)\nJob Types: Full-time, Temporary"
  },
  {
    "": "The company was established in 2012 to provide transparent and efficient foreign exchange, International Payments and Strategic Business Services.\n\nThe Founder and Managing Director has over 20 years of experience working with leading foreign exchange and international payment providers before setting up his successful business...... click apply for full job details"
  },
  {
    "": "Job DescriptionAgile Coach\n\nBelow, you’ll find a complete breakdown of everything required of potential candidates, as well as how to apply. Good luck.\n- Denmark\n- Freelance / Contract 4-5 months INTERVIEWS NEXT WEEK with an IMMEDIATE START My client is looking for an Agile Coach for an initial period of 4-5 months.\n\nPREFERENCE IS FOR LOCAL DANISH AGILE COACHES We are looking for pure agile coaches to coach and mentor on both team level and higher leadership levels focused purely on team coaching and special topics as needed.\n\nTechnical Background would be helpful but not essential.\n\nPlease contact me URGENTLY on\n- + or apply to the advert This job ad was posted by Salt.\n\nTo find out more about Salt's Privacy Policy and how your application is processed, please visit our website"
  },
  {
    "": "Perfect role for a 3D Creative Designer/Visualiser, passionate towards telling stories in moving image.\n\nOur client is a globally-focused studio that creates iconic world firsts in Art, Architecture, Theatre, Museums, Advertising, and Live Events.\n\nThe company’s unique studio model unites the efforts of directors, artists, programmers, designers, producers and technical specialists, resulting in a deeply collaborative and multidisciplinary approach to making immersive installations, live performance stages, and bespoke creative explorations.\n\nOne of the current projects they have in hands is for a big international exhibition. They are looking for a designer on a midweight or junior capacity, to help the CD with direction. They want someone who they can sit and offload ideas and concepts with and that is able to mock up those ideas / concepts quickly, visualise them then send them to the rest of the team. These won’t be perfect renders, rather sketches.\n\nThe ideal person needs to work... in 3D (C4D or maya) and become an extension to the creative directors’ mind further evolving his/her ideas into designs and visuals that can later be produced by team members. They seek someone able to design concepts for narrative driven content, that tells a story through mixed 3D media. Although this role is not hands on animation, its crucial for this person to have a deep understanding of a 3D animation process, in order to design for it.\n\nNeed to be able to help manage the workflow and pull together mood boards, visualisations and must be able to put together a client presentation deck efficiently.\n\nBasically, someone highly conceptual, a creative with visual problem solving will be essential, a person that a CD can have clear and decisive conversations with about the creative process. A good technical understanding of workflows and pipelines is desirable. Software wise you’ll be using C4D mainly.\n\nLooking for an impressive portfolio of creative work, with a proven ability to work across a range of projects in a variety of styles, the candidate must be excited about the prospect of working on a diverse range of projects"
  },
  {
    "": "Freelance M&E Quantity Surveyor\n\nFreelance | M&E Estimator | London | Industrial | Commercial | Fit out | M&E | Estimating\n\nAn award winning interior fit out construction company, is now looking for a freelance M&E Estimator, to support them with their on going high end projects.\n\nThe organisation are a short walk from Marylebone station, and continuously support clients within the Residential and Commercial world.\n\nA clear M&E background is required along with an understanding and experience within the Fit Out side of the business.\n\nRequirements\n• M&E background\n• Commercial, Industrial and Residential background\n• Relevant degree within construction\n• 10+ years Estimating experience\n\nRole: M&E Estimator\n\nLocation: London\n\nSectors: Commercial, Industrial and Residential\n\nDay Rate: Â£400-450\n\nDuration: 6 Months\n\nIf you are a M&E Estimator, looking at your career options, then please call Luke Carroll at Brandon James.\nRef: LC8428\n\n\nFreelance | M&E Estimator | London | Industrial ... Commercial | Fit out | M&E | Estimating\n\nRequired Qualifications\n• None"
  },
  {
    "": "This role would be perfect for an enthusiastic, analytical and creative person. You will be joining an agency based in Central London. You will be responsible for paid social for the business ensuring they provide innovative solutions for a well-known client.\n\nThe ideal candidate will have experience in planning, building, optimising and reporting on campaigns...... click apply for full job details"
  },
  {
    "": "We are looking for qualified Free Lance Trainers to deliver training.\n\nBenefits\n• A competitive salary\n• Flexible working hours\n• Always work available\n• Career progression\n• Working among a fantastic team\nTrainers must have the relevant experience and hold a teaching/training qualification.\n\nYour Role Will Include\n• The provision of high quality training which is planned and personalised to meet the needs of the individuals, whilst ensuring aims and objectives of both the awarding body and company standards are met.\n• Helping to develop new training materials and resources.\n• Obtaining feedback from candidates and employers assess the effectiveness of training.\n• Accurate completion of all required documentation.\n• Reviewing and identifying your own professional development need\nFurther and Adult Education Teachers Certificate\n\nCert.Ed/ PGCE/ B.Ed/ M.Ed\n\nPTLLS/ CTLLS/ DTLLS/AET\n\nIf you are interested in this position, please send us your CV\n\nwww.tutorcare.co.uk"
  },
  {
    "": "What is Bidvine Photography?\nAre you looking for a photography gig in London?\n\nIt’s easy to become a Bidvine photography, and it’s always free to create a business profile and start receiving leads. Bidvine helps professionals from all areas expand their customer base. New photographers looking to win their first customers and build a book of reviews are also on Bidvine.\n\nJoin Bidvine as a freelance photographer now!\n\nWorking with Bidvine Photography in London\nBidvine lets you find photography gigs all over London and message potential customers yourself! You can then decide on a perfect time that fits your schedule and optimal pricing. All you have to do is create a free account, describe your services, add a few photos, and you are good to go!\n\nWhy you should find your next photography gig on Bidvine:\n\n• Get customers that are a match for you\n\nBidvine supports any service you can think of, from photography to photography. That’s how they help thousands of people find professionals... like you! You will receive job leads for customers that are a match for you in terms of location, pricing and duration of the task.\n\n• You have full control\n\nOne of the best things about Bidvine is that you have full control over your availability, job preferences, prices and even how you interact with potential customers.\n\n• Bidvine has your back\n\nBidvine wants to make the experience pleasant for you and the customers, that’s why they offer tools, tips and support to maximise your success. You can call them any time you encounter a problem or you have questions.\n\nHow much Bidvine Photography pays in London\nAs a photographer in London, you will earn around £15 per hour. You will bid on jobs (you can also set up BidMatch and send bids automatically to be at the top of every customer’s inbox.)\n\nDon’t forget that all payments are between you and the customer. ** All future repeat business is solely yours.**\n\nHow do I apply for Bidvine Photography in London?\nSign up on Bidvine’s website to get started. Follow these steps to meet customers and begin your Bidvine journey as a photographer.\n\n• Create an outstanding profile\n\nGo ahead and create your profile on Bidvine. You will describe your services, what makes you stand out, how many customers you are looking for etc. You will also add a few photos and give as many details as you can about the services you provide.\n\nBidvine’s profile builder will help you make a great profile that really stands out.\n\n• Get matched with customers\n\nOnce you have set up your preferences, Bidvine will only match you with customers you want. You will bid on jobs, and if you win, the job is yours to complete!\n\nWhen you review a customer’s request, you will also be able to see how much it costs to send a bid. You will be charged once you send your bid. If the customer does not view your bid within 4 days, then you will be refunded your bid in Bidvine credit.\n\n• Complete the job and get paid\n\nYou will bill the customer yourself once the job is complete and receive your payment. Remember that it’s your responsibility to finalise the details and bill the customer"
  },
  {
    "": "Are you in the market for an early level Motion Designer role? Have gained some experience in 2D and 3D, and now ready to progress further?\n\nThis may be the one for you.\n\nOur client is an innovative, creative branded-content studio specialising in film. They are now on the lookout for a full-time Motion Designer to join their in-house post-production team in Central London.\n\nYou will be working across a variety of projects: from 2D and 3D animation, to graphics over live-action, from editing projects to motion graphic titling, from creating storyboards to mood boards. A major part of your role will involve working with one of the studio’s retained clients (an advertising agency) to produce a wide variety of video content for them; sizzle reels, mood films, online content, pitch videos, industry award films, etc.\n\nThey are looking for someone who is excited about the prospect of being a part of a team and enjoys collaborating, thinking differently, learning, and coming up with... captivating and original ideas. If you are skilled in storyboard design, and creative use of Adobe Creative Suite (especially After Effects), this may be the perfect role for you.\n\nSalary ranges between £22k and £28k depending on experience"
  },
  {
    "": "Freelance Interior Architect - High-End Residential - NW London\n\nFreelance Interior Architect required to join a practice based in NW London. Due to recently taking on two new residential projects our client requires an Interior Architect to join their small team and work alongside the team of Interior Designers.\n\nThe practice is made up of a team of 5 across design and administration and they have both private client and developer clients across London and other parts of the UK. With an extensive network of reputable suppliers and expertise in bespoke furniture and lighting they create unique spaces tailored to each individual client.\n\nRole & Responsibilities\n\nTo produce technical drawings, plans, elevations and project deliverables\nPresent interior architecture proposals to clients and team members\nOversee the technical aspects of the residential projects\nOn-site visits and inspections\nLiaising with clients, contractors and third parties.Required Skills & Experience\n\nProven... experience working on high-end residential projects (ideally 3 years+)\nProficient user of AutoCAD, InDesign and Photoshop\nExperienced at supplier and client liaison, able to confidentially present concepts/plans to clients\nStrong project management skills.What you get back\n\nDaily rate of £100 - £200\nPotential flexibility during the week to work remotely\nSocial and outgoing environment.Apply\n\nIf you meet the criteria above, send us your CV and portfolio. We receive a large number of applications so if you do not hear back within 7 days consider your application unsuccessful this time. We will keep a copy of your details on file for future vacancies.\n\nIn accordance with GDPR, by applying for this position you give us your consent to process your data in-line with our Privacy and Data Protection Policies which can be read on the privacy policy page on our website.\n\nReferral\n\nDid you know we run a referral scheme? We'll give you £300 worth of vouchers if you introduce us to anyone who we then successfully place in a new job role. Just send us their information and we'll do the rest.\n\nTerms: A candidate is deemed to have been successfully placed once they have started a new job as a result of an introduction made by Hunter Dunning and when they've successfully completed the probation period.\n\nFreelance Interior Architect Job in NW London - Your Interior Design Recruitment Specialists (Recruiter: Matthew Trussler Job Ref: 11013"
  },
  {
    "": "A small but highly creative client on mine that only works with the most amazing brands around the world from here to Amsterdam and New York, are after a 3D designer with Vectorworks and Sketchup.\n\nInterviews will be held next week to start the week after, so if you're becoming available and have brilliant retail interiors experience, get in touch with CV and folio to be considered!\n\nTo receive up-to-the-minute job info, just follow us on at Twitter.com/networkrecruit Network is acting as an Employment Business in relation to this vacancy and is an Equal Opportunities and Age Positive Employer."
  },
  {
    "": "Our Client is a globally-focused studio that creates iconic world firsts in Art, Architecture, Theatre, Museums, Advertising, and Live Events.\n\nThe company’s unique studio model unites the efforts of directors, artists, programmers, designers, producers and technical specialists, resulting in a deeply collaborative and multidisciplinary approach to making immersive installations, live performance stages, and bespoke creative explorations.\n\nThe ideal person needs to be a grown up (wink), focused and adaptable to the everchanging and unique essence of the project, able to work and think in a very agile way.\n\nYou’ll need to be able to manage the nature of the project but also different artists that are working remotely in different time zones. There is a lot of hours of CGI (Maya and C4D) to be produced. You’ll work along an in-house producer, management team and report to the executive producer. This is a very specific and special project filled with intricate details and animation... great for someone with a forensic eye for details, who is capable of project managing the workflow.\n\nYou will need a good understanding of the content production process for 3D animation, motion graphics and VFX.\n\nAmazing communication, organisation, management and administration skills, you’ll be a creative problem solver and excellent team member, you’ll manage relationships and workflows, create, develop and maintain timelines, and manage / reconcile project budgets with Senior Producer. Ensure the project remains on schedule and have great client facing skills. There might be travel and weekend work involved too.\n\nIn terms of experience and tools:\n\nImmersive media and VFX experience, as production manager or line producer would prove highly beneficial\n\nExperience handling complex budgets and schedules\n\nOrganising and planning, able to work across multiple projects\n\nAttention to detail and great communication skills\n\nComputer literate; Google Apps, Microsoft Office Apps\n\nExperience of Notch, Wrike and Frame.io\n\nExperience producing in other territories is a PLUS\n\nOther languages skills are also a PLUS – especially Russian\n\nPosition on site, in London for 2-3 months\n\nMight include short term international travel\n\nSounds like you can help"
  },
  {
    "": "Offer description :\n\nJob DescriptionFreelance Integrated Designer Mid to Senior level My Client is a fantastic creative marketing agency who are looking for a freelance Integrated Designer to join their small but stablished design team. They deliver strategic thinking, and creating effective marketing campaigns within the B2B sector. As a freelance Integrated Designer you will join this innovative agency at the start of a new project. You will be working alongside the design team and will be responsible for producing concepts rolling them out to print ready artwork. Ideally you will be a Midweight - Senior Integrated Designer experienced within the B2B sector. The perfect candidate for this role is someone who is as comfortable designing for digital as well as your more traditional print projects, you must be meticulous and have a great eye for detail, great typography skills, experience designing brand guidelines, producing text heavy documents. It is desirable if you have a strong... knowledge of HTML. You must be immediately available Buckinghamshire. (If you are not immediately available, please get in touch anyway, as the same client will need more support within the next few months) Freelance Integrated Designer The duration of this job will be 1 week initially but potential to extend to a rolling weekly booking and will be based in Milton Keynes. Ideally you will be able to drive and own a car as this agency is not commutable from public transport. Profiles Creative recruits for the creative industry from 4 divisions: Digital, Design, & Creative, Marketing & Ecommerce, PR and Fashion & Retail. We recruit both agency and in-house for permanent, contract and freelance positions. For the quickest access to our jobs, news and insights please follow us @ProfilesCounty or Please send your CV and portfolio"
  },
  {
    "": "Renowned east London motion design studio, known for pushing creative boundaries seeks freelance 3d Motion Designer on a freelance monthly engagement.\n\nYou’ll be welcomed as a member of the core team, be expected to conceptualise and research and develop ideas, design/model/build, apply renders/texture/lighting and animate 3d to produce fresh and unexpected work. Projects are plentiful and range from broadcast design, to promos, commercials, brand films and VFX for feature length too.\n\nYou’ll gain exposure to various projects/brands/genres, international work with healthy budgets to produce forward thinking work. Also, be surrounded by lovely creative folk who aspire to innovate.\n\nThis company is open to seeing applicants at all career levels. Ultimately they seek a creative 3d Motion Designer with advance level Cinema 4d, Redshift and After Effects skills, and experience in Houdini. Someone who has put together a showreel with care and attention to overall aesthetic.\n\nCould this be... you"
  },
  {
    "": "Offer description :\n\nAre you a Paid Social Manager looking for your next freelance opportunity? This is an exciting freelance role that will see you work across a number of key client accounts and be an integral number of the integrated performance team. This is a freelance role to start ASAP and can be long term for the right candidate. This is a London office based role that is inside IR35. As Paid Social Manager you will be responsible for the planning, execution, optimisation and reporting of social media advertising for the agencies largest and most prestigious clients. Day to day you will be planning/ buying across key social channels such as Facebook/Instagram, Twitter, Snapchat, Pinterest and more. The Role: You'll utilise your in depth Paid Social skill-set to work across a range of client accounts. Working on a mix of branding and DR activation, so a good variety of tactics/platforms and an varied workload. Working on campaign management, optimisation and reporting Account... servicing and quality control to meet target KPIs About you: Your paid social agency background will allow you to effectively manage campaigns and deliver on client's objectives hands-on experience in paid social advertising formats and creative best practice highly motivated, numerate and articulate, both when speaking to clients, writing documents and analysing If this role sounds of interest please hit apply or hit me up on LinkedIn: Laurence Kowalewski"
  },
  {
    "": "We are looking for all levels of DM and CRM professionals from top London agencies looking for new roles. If you're an AM or SAM, AD or BD/GAD with direct marketing/BTL integrated or digital experience in a UK agency, looking for a day rate to make your friends jealous then talk to us today. We have many great briefs for all levels with very competitive day rates.\n\nWe have a great range of briefs from a variety of integrated agencies in central London locations. We're looking for Account Managers, Senior Account Managers, Account Directors and above to fill roles from 1 month to 6 months and beyond."
  },
  {
    "": "Freelance Project Manager\n\nFreelance Project Manager | Fit Out | New Build |Refurbishments | Commercial | Laboratory | London | Contractor\n\nA large and well-established construction company is looking for a Project Manager who will run a fit out and refurbishment project near Barbican, London. The project is a commercial and laboratory fit out and refurbishment project with lots of stake holders. Experience of managing lots of stakeholders will be key in delivering this project.\n\nThe company has had very successful developments across London and Essex. These developments consist of Refurbishment, Restoration, New-Build and Fit Outs.\n\nThe project manager will have a critical role in final delivery of this project, being able to manage different sub-contractors and clients is going to be key.\n\nRequirements\n• 7+ years relevant construction experience\n• Degree in relevant field preferable\n• Available immediately\n\nRole: Project Manager\n\nLocation: London\n\nSectors: Fit Out, Refurbishments... Commercial, Laboratory\n\nDay Rate: Circa Â£300\n\nIf you are a Project Manager, looking at your career options, then please call Sam Hughes at Brandon James.\n\n\n\nFreelance Project Manager | Fit Out | New Build | Refurbishments | Commercial | Laboratory | London | Contractor\n\nRequired Qualifications\n• None"
  },
  {
    "": "Job Introduction\n\nBBC World News is the BBC’s most watched TV channel – viewed by nearly 100 million people a week and available in more than 300 million households around the world.\n\nThe BBC has been committed to journalistic excellence for more than 80 years. BBC News aims to provide access to the information and ideas everyone needs to make sense of an increasingly complex world on whatever platform they chose. Through its emphasis on specialist knowledge, international newsgathering and its breadth of programmes, BBC News seeks to deliver a complete news package, covering arts, science, sports, politics, business and world affairs. With its team of 2,000 highly trained journalists and over 40 news bureaux, BBC News strives to bring impartial and trusted news reporting to audiences all over the globe.\n\nRole Responsibility\n\nWe’re creating a talent pool of producers on a freelance basis who we can contact to work with us at peak times.\n\nYou’ll work effectively as part of the team... within BBC World News as directed on a variety of duties: writing and producing world news stories for TV using text, stills, video and graphics; gathering and working on information from various sources such as UGC and social media; writing headlines, structuring sequences and stories and working on OBs if required; contributing to the planning and origination of new angles and stories.\n\nAre you the right candidate?\n\nYou will need a good knowledge of our editorial agenda, sharp production and writing skills and be able to respond to a fast-moving news environment. Candidates should enjoy working under pressure and bring plenty of story, contributor and production ideas to the role. You will be expected to work across our platforms and have an understanding of the different production methods as well as audience needs. You will be comfortable with technology and social media, able quickly to pick up new skills and turn ideas into engaging coverage. You will need a thorough understanding of the BBC’s editorial guidelines and values or the ability to pick this up quickly.\n\nAssessments are expected to take place in April 2020. Those successful after the Assessments will be invited to an interview.\n\nPlease note that you are required to complete a tailored application questionnaire as well as your CV. Please keep to the word count for each of the questions were specified.\n\nPackage Description\n\nAll opportunities offered, as a result of appointment to this talent pool, will be on a Freelance PAYE basis.\n\nAppointment to the Talent Pool will not entitle candidates to a permanent contract in the BBC, those will have to be applied for in the normal way, and neither does it guarantee work. However, it may lead to consideration for broader freelance opportunities across BBC News.\n\nAny freelance work offered will be carried out at our New Broadcasting House office in Portland Place, London, W1A 1AA.\n\nIf you already have a current staff contract with the BBC (continuing or fixed term), you won’t be eligible to apply.\n\nAny work offered with the BBC will be conditional upon you having the right to work in the UK.\n\nAbout the BBC\n\nWe don’t focus simply on what we do – we also care how we do it. Our values and the way we behave are important to us. Please make sure you’ve read about our values and behaviours in the document attached below.\n\nDiversity matters at the BBC. We have a working environment where we value and respect every individual's unique contribution, enabling all of our employees to thrive and achieve their full potential.\n\nWe want to attract the broadest range of talented people to be part of the BBC – whether that’s to contribute to our programming or our wide range of non-production roles. The more diverse our workforce, the better able we are to respond to and reflect our audiences in all their diversity.\n\nWe are committed to equality of opportunity and welcome applications from individuals, regardless of age, gender, ethnicity, disability, sexual orientation, gender identity, socio-economic background, religion and/or belief. We will consider flexible working requests for all roles, unless operational requirements prevent otherwise.\n\nTo find out more about Diversity and Inclusion at the BBC, please click here\n\nBBCApply"
  },
  {
    "": "Description DescriptionAbout the role:Reporting into the Black & White Content Manager, you will be responsible for sub-editing and translating engaging, on-brand luxury product content, UX and marketing copy. Working with a multitude of varied luxury fashion clients, you will need to switch between copywriting styles fluidly and competently with a keen eye for detail. This role involves proofing all information which appears on the partnered brands' sites and maintaining high levels of accuracyEvery day will provide a new opportunity and the workload will become increasingly varied as the Black & White team expands its reach.Flexibility, tenacity and a collaborative attitude are essential for this new role. You will be experienced working in an environment which is fast-paced and deadline driven. Ideally this would have been within a sub-editing or proofreading role.What you'll do:\n• You will sub-edit and translate copy on both the CMS and live sites according to house style; working... to tight daily deadlines to check accuracy of product copy against images as well grammar, spelling and formatting\n• You will ensure all copy is clear, concise and localised where relevant\n• You will check accuracy of upload including product pages, user interface, technical copy (legal and transactional), creative copy (banners, email, SEO, newsletters) and click-through functionality\n• You will develop tone of voice documents for our partnered brands\n• You will work with our core copywriting team to ensure tone of voice is kept consistent across all languages\n• You will maintain quality of content on product pages Who you are:\n• You are fluent in Russian (Native level)\n• You are fluent in English\n• You have expert knowledge of luxury fashion brands and products\n• You have an excellent writing style that is accurate, engaging and adaptable, with an impeccable use of grammar\n• You have proven experience of digital translating, trans-creating and sub-editing\n• You have an understanding of garment and accessory construction\n• You have the ability to work independently\n• You have the ability to work quickly and to agreed daily targets and deadlines with a keen eye for detail\n• You are comfortable with digital work on an in-house CMS We can't wait to receive your application. But before you send it to us, here are some helpful tips to make sure your application is as strong as it can be.\n• Have you set out why this role is a good match for your career aspirations and that you have the skills and experience required? We want you to be as clear about your future ambitions as we are and whilst we encourage people to learn, develop and grow, you will need to hit the ground running.\n• Have you checked spelling and grammar? We have high standards and you don't want to miss out because of something as easily correctable as a typo. We are committed to equality of opportunity for all employees. Applications from individuals are encouraged regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships"
  },
  {
    "": "Our client is a design practice, specialising in architecture, technology and interior design. They are looking to employ a Technical Designer to provide assistance to the business in a technical / production capacity.\n\nJob Summary:\n\nProvide assistance to the business in a technical / production capacity. Candidates will be required to undertake a CAD test to demonstrate their ability producing technical details.\n\nCandidate Profile:\n• Minimum 10 years’ experience\n• Must be 100% proficient in AutoCAD\n• Excellent technical knowledge and understanding of the application of the UK Building Regulations\n• Extensive experience working on CAT B interior fitouts for RIBA Stage 4 onwards\n• Design and build experience with main contractors preferable\n• Ability to conduct design team meetings and contribute positively to the meetings and advise with authority on value engineering, design decision making etc\n• Must be attentive and confident in construction detailing\n• CAT A experience also... desirable but not essential\n• ACIAT/ MCIAT registered desirable but not essential (as long as the candidates’ technical knowledge can be demonstrated and verified)\n• Revit experience desirable but not essential\n• Sketchup experience desirable but not essential\n• Good knowledge of general admin packages such as Word, PowerPoint, Excel\n\nPackage:\n• Rate of £30.00 - £35.00 per hour (dependent on experience)\n• This opportunity is open to freelancers (LTD/Umbrella Company) only"
  },
  {
    "": "Research Manager : Brand Health & Comms\n\nFreelance opportunity for an experienced Research Manager with strong quant skills to join a dynamic international company in London.\nResponsibilities include\nProject design, analysis and reporting . Please note we can only consider individuals who have experience working in an agency or consultancy.\n\nLength of assignment : 6-8 weeks (possibly ongoing )\n\n£competitive rates"
  },
  {
    "": "No1 Fitness – Freelance Opportunities (City/Tower Bridge) At No1 Fitness we are looking for high caliber and experienced Freelance Personal Trainers wishing to rent space in our top London PT studios\n\nWe require self-motivated, inspirational and results-focused Freelance trainers who will fit into our ethos of excellence at No1 Fitness\n\nIn return you will have access to our slick and well-equipped City studios at an extremely competitive rental rate\n\nYou must have: A minimum of one years experience as a Personal Trainer, preferably with a Sports Science degree REPS Level 3 qualification or equivalent First Aid Qualification Public Liability Insurance At No1 Fitness we have the equipment needed to deliver a variety of high quality PT sessions\n\nWe have an expansive collection of dumbbells, kettlebells, barbells, squat racks, assault bikes, a sprint track, and a sledge\n\nWe recommend you come and visit us at No1 Fitness to see how our studios can work for your fitness business\n\nIf you are... interested in working at either of our sites, please e-mail your CV and cover letter to Operations Manager and we will be in contact\n\nRole: No1 Fitness – Freelance Opportunities (City/Tower Bridge) Job Type: Permanent, FullTime Location: London (Greater), South East England, South East England Apply for this job now"
  },
  {
    "": "A small but highly creative client on mine that only works with the most amazing brands around the world from here to Amsterdam and New York, are after a 3D designer with Vectorworks and Sketchup.\n\nInterviews will be held next week to start the week after, so if you're becoming available and have brilliant retail interiors experience, get in touch with CV and folio to be considered!\n\nTo receive up-to-the-minute job info, just follow us on at Twitter.com/networkrecruit Network is acting as an Employment Business in relation to this vacancy and is an Equal Opportunities and Age Positive Employer."
  },
  {
    "": "Offer description :\n\nJob DescriptionFreelance Digital Artworker My client are specialists in integrated campaigns, digital marketing and communications who are looking for a freelance Digital Artworkers to join their ever-growing talented pool of freelancers. As a freelance Digital Artworker you will join this agency at the start of an exciting new project. You will be working alongside the digital design team and will be responsible for artworking banners, emails, DOOH and microsites you must have experience using HTML, CSS and Adobe Animate, Ideally you will be a Digital Artworker with experience working within B2B/ B2C and marketing agencies. The perfect candidate for this role would be someone who has a meticulous eye for detail, have a digital focused portfolio and immediately available in Berkshire or Buckinghamshire (If you are not immediately available, please get in touch anyway, as the same client will need more support within the next few months) Freelance Digital Artworker... The duration of this job will be 1 week initially but potential to extend to a rolling weekly booking and will be based in South Buckinghamshire. Profiles Creative recruits for the creative industry from 4 divisions: Digital, Design, & Creative, Marketing & Ecommerce, PR and Fashion & Retail. We recruit both agency and in-house for permanent, contract and freelance positions. For the quickest access to our jobs, news and insights please follow us @ProfilesCounty or Please send your CV and portfolio"
  },
  {
    "": "We are looking for a Freelance Editorial Assistant to join the Scandi team to work part time, from mid May to mid July. This role can be based in London or Stockholm."
  },
  {
    "": "Position: Graduate Events Management Job £24K Clean Energy Events Central London\n\nCOMPANY DESCRIPTION\n\nOur client is an independent conference producer, specialised in the European power sector.\n\nThey create, promote and deliver high quality technical conferences for the engineering community. Their mission is to Drive Clean Energy, and their values are ACE: Ambition, Customer Centricity, Excellence.\n\nLaunched in 2011 they are an entrepreneurial business with a reputation for working to extremely high standards, exceeding customer expectations, and delivering exceptional results. They are currently expanding the business and searching for talented individuals to join the high performing conference production team.\n\nJOB DESCRIPTION\n\nThe conference producer is the project leader and P&L owner in the business. They carry out the market research, initiate and develop the industry relationships, drive the promotional strategy, and oversee the on-time and on-budget delivery of their... portfolio of events.\n\nThe business has a 333 strategy which will take them into 3 different carbon reduction markets, through 3 different information product formats, in 3 different regions globally. Their growth is organically funded and entirely dependent on getting the right people into the right roles doing the right work.\n• Research - carrying out in-depth phone research with senior technical representatives of the business community and interpreting the results into commercially compelling conference programmes\n• Speaker acquisition - identifying, profiling and inviting influential technical decision makers and specialists from the business community, and maintaining long term relationships\n• Copy writing - writing promotional copy in the form of weekly newsletters, website copy, brochure copy, press releases and advertising copy, to drive awareness of the events and stimulate bookings\n• Sales & marketing - thoroughly briefing the sales and marketing teams and monitoring campaign progress to ensure revenue targets are met\n• Onsite delivery - working with the event logistics team to ensure flawless onsite delivery of the events\n• P&L management - monitoring campaign revenues and costs and ensuring that targets are met, and profit margins are delivered\n• Productivity management - meeting all project deadlines to ensure the annual target of 6 events per producer is delivered\n\nWHO FITS THE BILL\n\nThe salary for this role offers £22,000-£24,000 + 3-5% Commission (OTE £35,000)\n• 2.1 degree or higher in a technical, engineering or business-related subject\n• 3 or more A’levels at grade B or above\n• Verbal references from your 2 most recent employers\n• Driven to deliver results in a high-pressure deadline driven environment\n• Evidence of creative problem-solving capability and an optimistic growth mindset\n• Passion for research, information gathering and knowledge building\n• Influential and persuasive approach to both written and verbal communication\n• Ability to initiate and develop relationships with high level business leaders\n• Organised and able to self-manage and project lead to get the best out of others\n\nIn return you will benefit from the following;\n• Unparalleled on-the-job training delivered by the highest calibre conference production experts in the industry\n• Structured career path enabling you to leverage your talents, strengths and motivations to climb the ladder of success\n• Opportunity to work across different geographical markets in Europe, USA and Asia\n• An elite team environment where you will learn as much from your colleagues as you will from your managers, trainers and mentors\n• Wellbeing programme including weekly meditation, book club, culture club, fresh fruit, standing desks, last Friday drinks\n• Inspirational programme delivered by external thought leaders to fuel your creativity, ambition and career progression\n• A meritocracy where your efforts are recognised, rewarded, and reciprocated"
  },
  {
    "": "Freelance Building Surveyor\n\nBuilding Surveyor | Chartered | London | Project Management | Property | Contract Admin | Condition Surveys | RICS\n\nA well-established Construction Consultancy with ongoing projects across Greater London and the surrounding Home Counties is looking for a Freelance Building Surveyor to join their office in London. The Consultancy has been operating for over 20 years with projects in the Residential and Commercial sectors.\n\nThe Building Surveyor, will support them with their ongoing projects with duties such as Report writing, Contract Admin, Project Management, Residential Surveys and Client meetings.\n\nExperience Requirements\n• MRICS\n• BSc in Building Surveying\n• Experience with Contract Administration\n• Consultancy Experience\n• Residential and Commercial Sector Experience\n• Immediate Start\n\nRole: Building Surveyor\n\nLocation: Central ondon\n\nSectors: Residential & Commercial\n\nDuration: 3 months\n\nDay Rate: Â£380.00 - Â£420.00\n\nIf you are a Building Surveyor... and match the description above, please get in contact with Luke Carroll at Brandon James.\n\nRef: LC8484\n\n\n\nBuilding Surveyor | Chartered | London | Project Management | Property | Contract Admin | Condition Surveys | RICS\n\nRequired Qualifications\n• None"
  },
  {
    "": "The company was established in 2012 to provide transparent and efficient foreign exchange, International Payments and Strategic Business Services.\n\nThe Founder and Managing Director has over 20 years of experience working with leading foreign exchange and international payment providers before setting up his successful business.\n\nHe was a consistent top performer as a Business Development Manager, Sales Manager and Sales Director in his previous roles bringing that wealth of experience to his team.\n\nThey are looking for talented people, experienced in selling into the B2B market to join their growing team here in the UK.\n\nThe company provides foreign exchange and payment services to businesses, organisations and individuals involved in overseas transactions. Transferring money overseas through a bank or Non-Bank provider often incurs high and hidden charges. Using their foreign exchange facility is quick, convenient and saves their customers time and money.\n\nThey are growing rapidly... and expanding their services to meet the increasing demands of their clients: These include Payroll, Probate, Utilities and HR services. This means you will be getting a career and they will give you a purpose - to help people and their businesses prosper.\n\nForeign Exchange is an exciting and fast-paced industry and no two days are the same, with varied enquiries coming through. So, you will need to be comfortable working with conflicting priorities and naturally resilient.\n\nKey Responsibilities:\n• Developing new business\n• Account Management and Customer Retention\n• Showing companies and individuals how to manage their foreign exchange exposure.\n• Providing good customer service\n• Managing relationships and developing business through face to face appointments and outbound calls, and being reactive to inbound calls and emails\n• Managing administration to demonstrate best practice, which meets or exceeds regulatory requirements\n• Taking ownership for and educating clients\n\nAbout you:\n• Experience within a similar B2B role is required\n• Strong organisational skills, time management, and diary planning skills\n• Self-motivated\n• Excellent interpersonal and customer care skills\n• Ability to communicate with people at all levels and from all backgrounds\n• Strong relationship management, both internally and externally.\n\nFor your commitment and success, we will offer:\n• The freedom to be your own boss, while also being part of a team.\n• Uncapped earnings with a distinct career development opportunity.\n• Mentoring and training by John Hall helping you succeed and reach your full potential\n• Provision of all the policies, tools and guidance you will need.\n• Unlimited holidays\n• Partnership Ownership Scheme.\n• Excellent recognition\n• Flexible work options to help you deliver in a way that suits you\n• Tailored training and development opportunities designed to suit your lifestyle\n\nCommission Only, OTE:\n• 1st year £50,000\n• 2nd year £125,000\n• 3rd Year £175,000\n• All uncapped\n\nThey are passionate about helping people and businesses prosper and they strive to be simple, personal and fair in everything they do.\n\nThat's why they're building a culture of respect, where everyone is empowered to keep their promises and go above-and-beyond for their customers, colleagues and the clients they serve.\n\nSounds interesting? Click the APPLY button now for consideration.\n\nCandidates with previous experience or job titles including; Business Development Manager, Business Development Executive, Sales Manager, B2B Sales Executive, Account Manager, BDM, may also be considered for this role.\n\nIND123"
  },
  {
    "": "Description\n\nStep into Dance Freelance Dance Practitioners\n\n£41.00 per hour\n\nTerm time, after school. Includes evening work\n\nAd-hoc projects during holidays periods and weekends\n\nVenue: across London and Essex\n\nWe are currently recruiting for Freelance Dance Practitioners that are available to teach across East London, Bromley and Essex specialising in teaching all forms of street dance, contemporary dance and cultural dance styles.\n\nStep into Dance is a Royal Academy of Dance programme run in partnership with the Jack Petchey Foundation, enabling young people to develop their passion and skills of dance through a diverse and inclusive programme of weekly classes, workshops and performance opportunities. Working with mainstream and SEN schools across London and Essex, Step into Dance reaches around 6,000 students annually, aiming to reach those that might not otherwise connect with dance.\n\nThis is an excellent opportunity for individuals who are reliable, professional and passionate... in inspiring young people, and would like to join a team of specialist dance practitioners to contribute to the successful delivery of our programme.\n\nAs a Dance Practitioner, you will have:\n\n- Skills and experience in one or more dance style;\n- Experience of planning and delivering dance sessions and projects for young people;\n- Good communication skills with the ability to form effective relationships with stakeholders;\n- Ability to engage and motivate young people with little or no dance experience. It is a bonus if you:\n\n- Have your own dance practice and/or professional dance performance or choreographic experience;\n- Have knowledge of secondary school education system and/or working in SEND schools\n- Have knowledge of relevant legislation for working with young people. If you meet these criteria, we would love to hear from you"
  },
  {
    "": "TFS is a Global CRO headquartered in Sweden. We genuinely believe that “Global in mind and local at heart” is the core of our success; we operate in a global environment while retaining an in-depth knowledge of regulatory requirements in every country where we operate. At TFS, you will be offered the possibility to develop in a global organization with a company culture distinguished by passion, innovation and talent.\n\nThis position can be based in one of TFS locations in Europe or in the US: http://tfscro.com/contact-us/\n\nThe Quality Manager is a position in the Quality & Compliance Department.\n\nThe Quality Manager is capable of independently conducting all types of GxP audits including system audits according to company policies, SOPs and regulatory requirements.\n\nThis person has experience in clinical research and quality management and is able to provide support and advice throughout this area.\n\nKey responsibilities:\n• Prepare, conduct and follow up on all types of internal and... external GxP audits including system, process, investigator site and pre and post-marketing pharmacovigilance (PV)\n• Support and guide operational staff in preparing investigator sites for regulatory inspections\n• Support, guide and facilitate regulatory inspections and customer audits of the company and/or projects\n• Peer review of audit reports\n• Provide quality management advice and support to internal and external clients\n• Participate in internal meetings as required and liaise with other departments as necessary\n• Actively contribute to continuous improvement of the TFS Quality Management System (QMS)\n• Develop new and review existing Quality & Compliance SOPs as required\n• Maintain required knowledge of applicable regulations and company GxP standards and procedures\n• Assist in writing SOPs for other departments\n• Assist with business development of external quality and compliance services\n• Accompany Commercial Operations colleagues on customer visits and participate in presentations when required.\n\nRequirements\n• University/college degree or equivalent industry experience\n• Awareness of global and local industry trends, government policies and regulations in the clinical trials and pharmacovigilance area\n• In depth knowledge of GxP regulations and guidance\n• Previous pharmacovigilance auditing experience is required, with thorough knowledge of requirements for PV compliance\n• Knowledge on GxP regulated computerized system validation activities and principles\n• Previous audit management experience\n• Good computer skills (Microsoft Word and Excel)\n• Ability to work independently and efficiently\n• Good planning, organisation and problem solving abilities\n• Fluent in English, both written and verbal\n• Several years’ experience in clinical research, (e.g. monitoring, data management, drug safety, training, etc.)\n• Three to five years’ experience of auditing in two to three GxP areas\n• International travel to audit sites, worldwide\n• Delegated for other tasks and activities by Quality Operations Director within scope of experience\n\nBenefits\n\nA great place to work where you will get the chance to push your career to the next level, global environment with global opportunities. You will also get the opportunity to be part of a team with highly intelligent, passionate experts from all over the world. TFS is a place for inspiration where we focus on the patients, saving lives and aiming to increase their quality of life by supporting our clients"
  },
  {
    "": "Position: Graduate Recruitment Consultant - Digital Marketing & Media Recruitment\n\nGraduate Recruitment Consultant - Digital Marketing & Media\n\nLocation; London\n\nStart date; Immediate\n\nTitle; Graduate Recruitment Consultant\n\nAre you interested in the fast paced digital marketing & media industry?\n\nAre you looking for dynamic, fun loving London offices in the heart of the city?\n\nDo you want to work with FTSE 250’s, Fashion Retailers, Consultancies & Boutique agencies?\n\nIf the answer is YES, Recruitment Consultancy could be the opportunity for you!\n\nWhat does this client look for in Graduate Recruitment Consultants?\n• Competitive nature: have you played sport to a high level?\n• Hard work: have you worked multiple jobs? Worked from a young age?\n• Resilience: have you overcome an injury? Career knockbacks? Financial strain?\n• Hunger for money: have you found innovative ways to put more money in your pocket?\n• FUN: do you thrive in a sociable, lively and dynamic environment?\n\nSound like... you? Read on!\n\nWhat should you know about this recruitment client?\n• Digital Recruitment Consultancy based in the heart of the City of London\n• Founded in 2013, they are rapidly becoming the industry leaders in Digital Recruitment\n• Work with Digital Designers, Consultants, Digital Agencies, Fashion, Tech & Creative firms\n• Young, determined team striving to become world leaders in digital recruitment\n• Champagne Friday’s are an essential part of the week!\n\nProgressive, supportive and collaborative - sound good?\n\nWhat can this recruitment client offer you?\n• One to one recruitment training from Senior Consultants, and a whole supportive network behind you every step of the way\n• Company Quarterly Incentives (Concerts, Football/Rugby tickets, Go Karting, Ascot, Holidays, Spa Breaks to name a few)\n• Champagne Fridays\n• Chill out area & beer fridge in the office\n• Basic salary of £20-25k + Uncapped commission structure:\n\n- £35,000 - £40,000 OTE Year 1\n\n- £50,000 - £60,000 OTE Year 2\n\n- £80,000+ Year 3\n• Career progression from Trainee to Director is completely in your hands - the sky really is the limit!\n\nIf this sounds like the right challenge for you - reach out today for IMMEDIATE CONSIDERATION!\n\nSW6 recruit in to all specialised sectors of recruitment consultancy including; Technology Recruitment, Trainee Recruitment Consultant, Finance Recruitment, Trainee Recruitment Consultant, Oil Recruitment, Trainee Recruitment Consultant,Gas Recruitment, Trainee Recruitment Consultant, Energy Recruitment, Trainee Recruitment Consultant, IT Recruitment, Trainee Recruitment Consultant, Management Consultant Recruitment, Trainee Recruitment Consultant, Engineering Recruitment, Trainee Recruitment Consultant, SAP Recruitment, Trainee Recruitment Consultant, HR Recruitment, Trainee Recruitment Consultant, Legal Recruitment, Trainee Recruitment Consultant, Paralegal Recruitment, Trainee Recruitment Consultant, Investment Banking Recruitment, Trainee Recruitment Consultant, Hedge Fund Recruitment, Trainee Recruitment Consultant, Digital Recruitment, Trainee Recruitment Consultant, Media Recruitment, Trainee Recruitment Consultant, Marketing Recruitment, Trainee Recruitment Consultant, Public Sector Recruitment, Trainee Recruitment Consultant, International Recruitment, Trainee Recruitment Consultant, Pharmaceutical Recruitment, Trainee Recruitment Consultant, Bioscience Recruitment, Procurement Recruitment, Trainee Recruitment Consultant, Supply Chain Recruitment, Trainee Recruitment Consultant, Management Recruitment, Trainee Recruitment Consultant, Board Recruitment and Executive Recruitment, Trainee Recruitment Consultant, Banking Recruitment, Trainee Recruitment Consultant, Change Management Recruitment, Trainee Recruitment Consultant, Insurance Recruitment Trainee Recruitment Consultant,, Multi-lingual Recruitment, Trainee Recruitment Consultant.\n\nWe typically place people into the following positions: Trainee Recruiter, Graduate Recruiter, Trainee Recruitment Consultant, Recruitment Consultant, Graduate Recruitment Consultant, Trainee Recruitment Consultant, Trainee Recruitment Consultant, Permanent Recruitment Consultant, Trainee Recruitment Consultant, Permanent Recruitment Consultant"
  },
  {
    "": "Job Description\n\nYou will work alongside the progressive and innovative Content Production & SEO team. This is a fully generalist role, with clear scope to be involved in all aspects of the work our brilliant team -does. You'll focus on creating 'revolutionary' listing descriptions, meta-descriptions and category copy, based on your research into brands and categories. You will be keen to gain SEO knowledge and working to the company's brand guidelines within a large multi-lingual team of around 45 employees, you will be required to create well-written, succinct and accurate translations to describe luxury clothing, accessories and lifestyle products sold on FF.com . What you'll do * You will produce listing descriptions in Arabic on a weekly basis (approx. 200 words each listing description) * You will become a quality guardian for our Arabic tone of voice and an expert on particular fashion brands and categories * You will track and correcting defects of listing descriptions and... other localized content Who you are * You are fluent in Arabic and English (spoken and written) * You are experienced in English-Arabic translations * You are keen to learn on SEO and optimising content * You have knowledge of fashion at all levels from high-end designers to cutting edge street style * You are a strong writer with a style that is accurate and adaptable * You are knowledgeable of garment and accessory construction * You are able to work to clear deadlines but also to work independently * You are able to work quickly and to agreed daily targets Non-essential but desirable * You are experienced with working in localization projects for e-commerce website, preferably luxury fashion retail. You will work alongside progressive and innovative Content Production & SEO team. This is a fully generalist role, with clear scope to be involved in all aspects of the work our brilliant team. You will work alongside the progressive and innovative Content Production & SEO team. This is a fully generalist role, with clear scope to be involved in all aspects of the work our brilliant team -does"
  },
  {
    "": "Offer description :\n\nJob DescriptionGerber pattern cutters are required to work for a variety of leading designers You will be experienced at Gerber pattern cutting and ideally have previously worked on ladies wear, You will have a successful track record of creating first patterns.You will also be fully competent to work creatively alongside the designer. Capable of working under pressure and on your own initiative"
  },
  {
    "": "Plant Designs\n\nMain Duties\n\nLove plants? Want to share that love with other people?\n\nAt Plant Designs we’re making London a greener place to live and work, creating and caring for planting installations all across the city. This year we’re expanding our offering to include an educational programme, where we teach our clients about the benefits of planting in an immersive, enjoyable environment.\n\nWe’re looking for a talented and creative person to join our team as a Workshop Leader. A passion for plants is an absolute must – the workshops will cover topics such as terrarium making and kokedama, but there’s flexibility for you to teach other relevant plant workshops depending on your interests. An open, vivacious personality is essential, and applicants must be comfortable with teaching and presenting to a group of people in a casual environment. This is a shared role, with several workshop leaders leading various workshops each week.\n\nThe hours are offered on an ad-hoc basis... approximately 2 evenings per week with rotas organised well in advance. To begin with hours will be mainly evenings between 5pm & 10:30pm and will be worked at our Farringdon showroom, however we are looking at expanding our workshop calendar to include daytime work. Should this be of interest, there is scope for successful candidates to increase their work hours accordingly, however this is not a requirement.\n\nDuties will include:\n• Liaising with Marketing Manager to coordinate workshops calendar\n• Ordering workshop supplies and managing stock\n• Leading 1-2 workshops per week\n\nSkills and Experience\n\nCandidates must have a strong passion for and working knowledge of plants, along with demonstrable skill in applying that knowledge creatively. We also expect candidates to have excellent interpersonal skills and the ability to confidently lead a group workshop"
  },
  {
    "": "Spring is home to a global community of affluential industry leaders, creators, marketers and entrepreneurs in the business of shaping contemporary culture."
  },
  {
    "": "Are you a passionate and energetic Production/Senior Production manager\n\nWe’re on the lookout for experienced Production/Senior Production managers to join the RPM family\n\nDue to some exciting client wins for 2020 we are looking for project managers to join us on a freelancer/FTC basis\n\nThis is a great opportunity for a passionate and energetic person to manage\n\nthe client end to end, overseeing the entire project.\n• Working alongside the Senior Production Manager\n• Managing events including vehicle hire, transport costs, technical support, accounts alongside\n• Management of subcontractors on site.\n• You will oversee budget of projects,\n• Panning and prep through to delivery.\n\nYou won't be afraid to roll up your sleeves and get the job done in the most efficient way.\n\nRequirements\n• Previous experience working on live events is essential as we need people who can come in and hit the ground running.\n• This role would suit someone who has previous project management experience, ideally... within the experitnial sector but this is not essential.\n• You’ll be an excellent communicator with a positive, ‘can do’ attitude.\n• Your attention to detail will be second to none and you will take pride in all the work that you do.\n\nBenefits\n\nWhat we can offer you…\n\nJoining the RPM family you can expect to be competitively rewarded for your hard work. You will be entitled to a wide range of benefits to support your needs and lifestyle, including\n• 25 days annual leave\n• Your birthday off on us!\n• Bike to Work’ scheme\n• Early Finish Friday - 4 pm\n• In house masseuse\n• Income Protection and Life Assurance Scheme\n• Simply Health Cash Plan\n• Referral bonus for new hires\n• Season Ticket Loans\n• Childcare Vouchers\n• Discounted Gym Memberships\n• Free Breakfast and Snacks\n• Socials and sports teams\n\nand many more...\n\nSo now what…\n\nIf you think you’ve got what it takes please submit a CV with your application, stating salary expectations\n\nRPM very much regret that due to the number of applications we receive, we are unable to respond to every application. If you do not hear from us within 4 weeks you should assume that you have been unsuccessful on this occasion.\n\nRPM are an equal opportunities employer.\n\nNo Agencies Please"
  },
  {
    "": "Are you a Paid Social Manager looking for your next freelance opportunity?\n\nThis is an exciting freelance role that will see you work across a number of key client accounts and be an integral number of the integrated performance team.\n\nThis is a freelance role to start ASAP and can be long term for the right candidate. This is a London office based role that is inside IR35...... click apply for full job details"
  },
  {
    "": "My client is looking for a talented senior UI designer to help bridge the gap on an important project whilst offering complete remote working.\n\nKey responsibilities:\n\n- Work in conjunction with stakeholders to develop design concepts & ensure project objectives are met & delivered on-time.\n- With a human centric approach, create systematic experiences & brand stories.\n- Understand the research and the impact it has.\n- Create identities, user interface patterns & narratives.\n- Leading by ensuring the creative output is second to non, mentoring the creative team on a daily basis.\n- Effortlessly merge strategy, copy, design, UX & technology into a cohesive brand or systematic experience.\n- Basic knowledge and understanding of code to make simple amends.\n- Understand the frequent change in landscape of design & technology.\n- Lead brief & idea conception, ensuring ideas are grounded in strategy & technology. Key requirements:\n\n- Experience of Agile working.\n- Great at communication with... clients & team reports.\n- Have a digital understanding, identifying & implementing solutions for digital.\n- Leadership experience, offering supportive guidance to your team.\n- Proven examples of a successfully launched projects.\n- 3+ years commercial experience in digital design or UI.\n- 1+ years management experience.\n- Demonstrated user centred design principles & interaction design principles.\n- Experience with design patterns & pattern libraries.\n- Used Sketch, Abstract, Sigma, Mac OSX, Adobe Creative Suite, Google Docs & Acrobat.\n- Great prototyping experience in Invision, Marvel or another similar tool.\n- Experience leading the design of large complex design problems.\n- Worked in a fast paced environment, working calmly under pressure whilst producing high-quality designs. This is a great opportunity where you’ll be working on some forward-thinking digital products, with the latest technology.\n\nTo start w/c 10th February for 6 weeks, with possible extension on a remote basis.\n\nCC123"
  },
  {
    "": "A rare freelance opportunity to join this industry leading fashion brand on their creative team as Film editor working across a variety of projects. You could be editing anything from a campaign to an event, to internal films or communication videos to needs to be someone well versed to hit the ground running.\n\nYou will be working across various digital platforms in post-production as well as working with the offline team\n\nResponsibilities include:\n• Produce files based on the creative brief\n• Input sound to the films\n• Digitally cut the files to sequences the films\n• Prepare all assets for other post work production\n\nSuitable candidates must have\n• Expert knowledge of Adobe Premiere\n• Good working knowledge of the Adobe suite including: Adobe Photoshop and After Effects\n\nIf you are available immediately with relevant fashion industry film editing experience, apply now!"
  },
  {
    "": "Morgan King Environmental - Asbestos Analyst - Central London - 10th March - 26th April\n\nWe are looking for a Asbestos Analyst in the Central London Area, working on static sites.\n\nDuties will include:\n• Air Testing\n• Personal\n• Leaks\n• Full Clearances\n\nWorking 7 days a week\n\nMust have P403 P404\n\nPlease call Lauren on (phone number removed)\n\nJob Types: Full-time, Temporary\nRole: Freelance Asbestos Analyst\nJob Type: Contract\nLocation: London, London,\n\nApply for this job now."
  },
  {
    "": "Description\n\nThe BBC World Service's Burmese Service is a well-known and highly respected news service in Burma, providing up-to-date news and current affairs in Burmese and covering both domestic and international news stories. It is multiplatform, with a multimedia website with a focus on digital video, text, interactivity for both desktop and mobile platforms, and a daily TV news programme in Burmese. The service aims to make international news relevant to Myanmar audience, and bring international perspectives to bear on Myanmar and global developments. Our service brings quality, impartial, original journalism with news and current affairs to the Burmese speaking region.We are based in New Broadcasting House, London W1, nearest Tube: Oxford Circus.Role Responsibility\n- To create original material for all multimedia output (TV, Radio, Online, Social Media) this will include writing for BBC Burmese website and other social platforms in an engaging format for the audience.\n- To... report, present, research, write, translate, edit and adapt stories or programme material for BBC Burmese Radio, TV, and online audiences\n- To be responsible for thinking through and around editorial problems, developing realistic alternative strategies and approaches.\n- To look for editorial synergies and opportunities, come up with ideas for content, forum guests and events, and ideas from BBC Burmese Service audience, and highlighting to other members of the team.\n- To offer ideas for sequences, packages and programme content. To suggest new angles on existing stories and to put forward stories not yet covered. To understand the Languages TV strategy and to suggest ideas appropriate to its distinctive style and content.\n- To be responsible for a moving story, amending and updating material as required. To be able to freshen a story.\n- To build and maintain links with other areas of the BBC including BBC WS Online and BBC News to enable the efficient production of content. Are you the right candidate?Successful candidate must have:\n- Experience working as a journalist, or experience working in a newsroom\n- Experience in writing news articles in Burmese\n- Experience presenting radio or podcast Package DescriptionThis is being offered as Freelance PAYE opportunities.Appointment to the talent pool will not entitle candidates to a permanent contract in the BBC, those will have to be applied for in the normal way, and neither does it guarantee work. However, it may lead to consideration for broader freelance opportunities across BBC News.About the BBCWe don't focus simply on what we do - we also care how we do it. Our values and the way we behave are important to us. Please make sure you've read about our values and behaviours in the document attached below.Diversity matters at the BBC. We have a working environment where we value and respect every individual's unique contribution, enabling all of our employees to thrive and achieve their full potential.We want to attract the broadest range of talented people to be part of the BBC - whether that's to contribute to our programming or our wide range of non-production roles. The more diverse our workforce, the better able we are to respond to and reflect our audiences in all their diversity.We are committed to equality of opportunity and welcome applications from individuals, regardless of age, gender, ethnicity, disability, sexual orientation, gender identity, socio-economic background, religion and/or belief. We will consider flexible working requests for all roles, unless operational requirements prevent otherwise.To find out more about Diversity and Inclusion at the BBC, please click here"
  },
  {
    "": "Doremus is an agency dedicated to the business of the brand. That means we study business. We believe that a day spent working on creative solutions to a complex problem you’ve never solved sure beats a day working on a problem you’ve solved a hundre"
  },
  {
    "": "Cuba Pictures is the TV and film production company that sits within the Original Talent Group which includes Curtis Brown. An exciting opportunity has arisen for a team assistant to join their busy team. They need someone who’s highly organised, good at problem solving, plans ahead and has excellent interpersonal skills. They would like someone with experience of working in an office within a creative / arts organisation. This position is a great opportunity for a bright, committed and enthusiastic individual who wants to learn more about the industry and enjoys working as part of a team.\n\nYou should be meticulous about detail and calm under pressure. This role requires very good communication skills and the ability to think creatively – you’ll need to use your initiative and be adaptable. You should have strong administrative skills and have a passion for TV, film, theatre and books."
  },
  {
    "": "Gujurati speaking Interpreters are urgently required by our clients (Schools, Courts, GPs and Solicitors) within the Greater London areas.\n\nRates of pay:\n• Interpretation: £15.00 an hour\n• Travel time: £6.00 an hour travel time (maximum of 2 hours)\n• Waiting Time: £6.00 (Varies depending on the time and situation)\n• Travel expenses: Will be refunded. You must keep your original receipt and Travel card in order to claim your expenses.\n\nPlease send us your CV and covering letter to the email address provided."
  },
  {
    "": "Creating videos of two 1hr training sessions, for future trainers to use as practice material.\n\nBackground:\nWe are running induction training for our charity's outreach trainers on 31st March and 1st April in Islington.\n\nDuring the induction, existing trainers will run the existing training sessions (two sessions, each 1 hr long). We want to video these 'best practice' training sessions so that the new trainers can use the videos as practice material, as they prepare to run the training themselves.\n\nThe training will take place in Platform Theatre Islington, with about 30 audience members sat cabaret style.\n\nThe trainer will be at the front, and will use a set of slides. During the training there will be audience activities, and we'd like these captured too.\n\nI imagine the final videos will be split screen with the trainer/audience on one side, and the slides on the other.\n\nThe output of this work is two 1hr videos.\n\nThe training sessions will take place at approximately:\n3-4pm on... Tuesday 31st March\n9.45-10.45am on Wednesday 1st April"
  },
  {
    "": "Please login and click on the website link to visit LONSDALE RETAIL and the vacancies they are trying To fill."
  },
  {
    "": "Freelance Designer - Women’s Intimates\n\nUrban Outfitters is bringing an alternative vision of retail to the world. We started out as a single boutique in 1970s Philadelphia, came to Europe 20 years ago and grew to 51 stores across the UK, Republic of Ireland, Denmark, Sweden, Belgium, Germany, Hong Kong, Spain, Italy and France. We’ve kept all our buying, merchandising, editorial and selling in-house as we’ve done it.\n\nNow we’ve got our eyes on new horizons. And we’re looking for talented, fresh-thinking and dynamic people to come with us\n\nWe are looking for a talented Lingerie & Swim Designer to join our fast-paced team.\n\nResponsibilities:\n• Developing an innovative yet commercial range of Intimates products to meet business requirements across the UK and Europe for stores and online.\n• Designing products which exceed the Urban Outfitters customers’ expectations of the brand, whilst remaining commercial in approach.\n• Designing products with an awareness of price architecture... margins and selling prices.\n• Working closely with the buying teams on colour palettes/key fabrication and trends for the coming seasons\n• Conducting regular trend updates, guiding key shapes, messages, fabrics, prints & colour. This given research will cover the more commercial of styles through to the more directional/emerging silhouettes and will always be catered toward brand aesthetic\n• Creating colour palettes - seasonal, departmental colour palettes are an essential tool and will be created alongside core Womens Apparel palettes. These need to be sympathetic to individual style & always trend driven\n• Working with the buying teams to define the collections and to produce them to reflect the Urban Outfitters concept whilst ensuring commerciality remains.\n• Keeping abreast of current season sales and create fast-react product in season to meet demands.\n• Reporting into the Head of Womenswear Design\n• Complete regular design research.\n\nRequirements:\n• The understanding of Urban as a trend maker and leader with the know how to take it to the next level.\n• Portfolio should be very directional and demonstrate an ability to think outside the box.\n• Be very detailed from concept stage through to specs and final designs.\n• Creativity and style.\n• Proven track record of delivering in season product.\n• Proven ability of managing internal relationships and communications.\n• Ability to perform under pressure.\n• Excellent commercial acumen with the ability to identify new opportunities with exceptional communication and presentation skills at all levels.\n• Proficient CAD – Illustrator/Photoshop skills.\n• Need to be experienced working with a global supply base\n• A confident communicator, you will be very well organized.\n\nSalary: On application. Please note your current salary when applying.\n\nWe look forward to hearing from you"
  },
  {
    "": "Please login and click on the website link for further information about DIGITAL STRATEGY CONSULTING and the vacancies they are trying To fill."
  },
  {
    "": "Senior Account Manager - Freelance or Permanent role, starting asap!\n\nThis is a great opportunity for a Senior Account Manager to come into an independent integrated agency and lead across some of the agency's key clients. We need someone quite specific for this one, and we need a Senior Account Manager who has worked on financial services clients with good, solid digital experience.\n\nThe agency works with a number of financial and asset management clients and they're keen to bring on board a Senior Account Manager who will help lead these key client relationships.\n\nWe are considering a freelance or permanent Senior Account Manager for this role. The freelance Senior Account Manager will be paid up to £220 per day, and permanent Senior Account Manager around the £35k - £40k mark.\n\nThe Senior Account Manager will report into the Senior Account Director and work very closely with one of the managing partners. The Senior Account Manager must have a very strong integrated background with... lots of digital, you'll be a Senior Account Manager who can work on brand and direct response led campaigns, making work that ranges from ATL, through to digital and social, content and film, and other integrated activations channels. These brands target consumers and businesses and we're ideally looking for a Senior Account Manager who can communicate to both groups.\n\nThe Senior Account Manager must have gravitas and leadership qualities, you'll be a Senior Account Manager who can work alongside clients at all levels, some quite corporate and you'll be someone who can hold their own with senior management. You'll be a Senior Account Manager who understands the digital landscape and can talk with confidence about creative integrated digital work.\n\nThe Senior Account Manager will be commercial, strong when it comes growing clients and their business, and you'll have an interest in the world of financial services and asset management, or at least have experience working with relevant brands.\n\nYou'll be a Senior Account Manager who can lead and inspire a small team, someone who can mentor and develop, and you'll lead by example.\n\nThe Senior Account Manager will have a real passion for making great creative work, this is quite a dry area however this agency makes some great stand out work, and the Senior Account Manager will help to push the creative aspirations of this brand.\n\nIf this sounds like you, and you're a driven and ambitious Senior Account Manager we want to hear from you immediately.\n\nPlease share your CV with rick@modaconsult.co.uk or press apply now and complete the form. At MODA consult we specialise in agency and client side recruitment, we have lots of roles available and please email rick@modaconsult.co.uk or visit modaconsult.co.uk"
  },
  {
    "": "Need someone to do bridal make up for 2 days 18th of March and 19th of March\n\nPlease ensure that your profile is complete with up-to-date examples of your work when applying and clear contact details."
  },
  {
    "": "We are looking for an experienced teacher with vision, energy and passion to join the team at Fairley House School."
  },
  {
    "": "Please login and click on the website link for further information about DIGITAL STRATEGY CONSULTING and the vacancies they are trying To fill."
  },
  {
    "": "Freelance Trainers – Technical Financial Modelling\n\nLocation: London\n\nSalary: £600 to £1000 a day\n\nClient Profile:\n\nWorking for a global training and conference provider in the Financial Services industry in the UK and internationally.\n\nWorking with some of the world’s largest banks and have an exciting new opportunity for a Freelance Trainer Technical Financial Modelling to deliver the training and other related areas based in Europe, Asia, Australia and Canada.\n\nKey Purpose:\n\nThey are looking for professionals with advanced corporate finance background who is able to work between 10 -100 days per annum and preferably have a teaching/training background or delivered substantial internal training. A summary of the details are included below:\n\nMain Duties:\n\n· Is an expert in one or some of the following areas:\n\nTechnical financial modelling such as: Project Finance Modelling or LBO Modelling\n\n· Meeting with and delivering course plans to corporate and personal customers,\n\n· Discussing... financial requirements, and providing appropriate advice\n\n· Training and supervising junior/senior banking staff\n\nPersonal Specification:\n\n· Need to have worked in a investment bank / corporate banking / Finance\n\n· 10 years’ experience in banking background\n\n· External Teaching /Training experience as a Freelance Trainer or having delivered substantial internal training within your own workplace (30+ session per annum)\n\n· Ability to prioritise, manage time and work under pressure\n\n· Willingness to travel in country and internationally\n\nThe Company is offering an attractive remuneration of £600- £1000 per day (approx 10-100 training days per annum) along with travel and hotel expenses paid for.\n\nThis position is suited to someone who is not looking for a full time job, is flexible to travel as and when required and possess the above minimum requirements (must have training experience).\n\nIf you are interested or would like to know more, please feel free to contact Marcus, or (0) or alternatively email your CV by clicking apply below"
  },
  {
    "": "Gerber Pattern cutters are required to work for a variety of leading designers\n\nYou will be experienced at Pattern cutting and ideally have previously worked on ladies wear, You will have a successful track record of creating accurate patterns.You will also be fully competent to work creatively alongside the designer. Capable of working under pressure and on your own initiative"
  },
  {
    "": "Are you a Paid Social Manager looking for your next freelance opportunity?\n\nThis is an exciting freelance role that will see you work across a number of key client accounts and be an integral number of the integrated performance team.\n\nThis is a freelance role to start ASAP and can be long term for the right candidate. This is a London office based role that is inside IR35...... click apply for full job details"
  },
  {
    "": "An exciting opportunity for an experienced PR Manager or Senior Account Manager to join the Marketing team on a freelance temporary contract.\n\nThis role will be responsible for\n• Driving the VIP collaboration launch,\n• Manage press events\n• Execute the in-store VIP strategy.\n\nLooking to fill this position immediately, fashion PR experience is essential.\n\nRef: 101102"
  },
  {
    "": "Who are we:\n\nFree2Learn are a rapidly expanding and vibrant company that provide free funded training courses for jobseekers giving them the opportunity to enhance their knowledge, develop their skills and gain qualifications in a wide variety of industries. Additionally, we focus on nurturing and harnessing the knowledge and competence of those already in work by delivering high quality apprenticeships and providing a high quality end to end job service.\n\nRole Purpose:\n\nWe have a very exciting opportunity for a Trainer to support the running of our centres, being responsible for the learning and achievement of all learners in the class. Furthermore, being responsible and accountable for achieving the highest possible standards in work, having an impact on educational progress beyond his/her assigned learners. Finally, assist in the smooth running of the Free2Learn at all times.\n\nRequirements\n\nMAIN ACTIVITIES AND DUTIES:\n\nKey responsibilities and objectives of the job are:\n•... Participate in a Learner centered approach to service delivery\n• Produce lesson plans, schemes of work, support materials and other teaching related materials;\n• Delivery high quality, engaging sessions to learners and ensuring high retention & achievement rates are in line with recommended targets;\n• Learner assessment to be completed to the agreed standards, providing feedback and guidance to learners, ensuring portfolios are completed and submitted in a timely manner;\n• Monitor attendance, punctuality & progress, maintaining appropriate records and ensuring that these are in line with recommended targets.\n• Provide learners with structured feedback, advice and guidance, enabling them to meet the learning standard in the allotted time;\n• Ensure that all reporting and recording relating to learners, which may include administration and assessment, is organized, and conducted as agreed;\n• Ensure lessons, delivery and assessments meet with the standards set by awarding bodies, prime contractors, Ofsted/Matrix or other Quality Frameworks and other organizations that monitor Free2Learn;\n• Ensure learners follow the policies provided to them in their learner handbook;\n• Fully comply with all statutory requirements including Safeguarding, Prevent and promoting British Values;\n• Provide additional support to learners who have barriers or need reasonable adjustments due to a disability, to support positive achievement and retention rates for all groups of learners;\n• Be prepared to work flexibly to meet the needs of learners;\n• Engage with other departments to support learners, for example Employer Engagement or Safeguarding Team.\nBehavior and Safety:\n• Ensure that learners are made aware of Health & Safety considerations and that they adhere to them;\n• Ensure that learners are made aware of Safeguarding, Prevent & British Values and how to make a referral;\n• Promoting Equality & Diversity ensuring learners receive equal opportunities;\n• Be a positive role model for the learners, demonstrating consistently a positive attitude, values and behavior, which are expected of learners;\n• Work with the wider team to facilitate a positive resolution to any concerns or difficulties with behavior management. For example, to pastoral care or management.\nProfessional Development/ Continuous Improvement:\n• Engage in regular standardization meetings and training to review the quality of the teaching and learning provision in line with the quality strategy;\n• Engage with and implement recommended actions from the ongoing feedback and development opportunities available from IQAs & Teaching, Learning Observations/ Learning Walks;\n• Maintain a professional level of subject expertise by being aware of relevant developments in both the subject area in addition to pedagogic developments;\n• Undertake continuous personal and professional development annually to ensure up to date knowledge subject areas delivering and submit an update CPD record regularly.\nSKILLS AND QUALIFICATIONS:\n\nEducation / qualification and training\n\nLevel 3 PTLLS or Award in Education and Training (AET).\n\nLevel 4 CTLLS or Level 4 Certificate in Education and Training (CET);\n\nLevel 5 DTLLS or Level 5 Diploma in Education and Training (DET) or CELTA or Cert Ed\n\nPostgraduate/ Professional Graduate Certificate in Education\n\nAssessor/ IQA qualifications.\n\nKnowledge / skills\n\nRecent industry experience for their subject area(s) ;\n\nKnowledge of Health & Safety ;\n\nIT Literate- MS Office, Outlook ;\n\nDemonstrate high levels of organisational skills ;\n\nDemonstrate ability to be self-directed with initiative and to be able to solve practical problems with limited supervision;\n\nDemonstrate a creative and imaginative approach to learner-centred delivery;\n\nDemonstrate a commitment to promoting and safeguarding the welfare of and young person’s and/or vulnerable adults;\n\nDemonstrate ability to prepare effective written and visual teaching materials in line with course requirement ;\n\nDemonstrate ability to work as part of a team and to develop and sustain good working relationships with internal and external customers.\n\nExperience\n\nTeaching experience, particularly with adult learners;\n\nExperience on Demonstrating a strong commitment to Equality and Diversity and how it affects the workplace/learning environment.\n\nOther requirements\n\nDemonstrate a good understanding of traineeships and adult learning and the training requirements of the industry"
  },
  {
    "": "This company is a property maintenance provider in the UK covering London and South East England. This company generates a large volume of customer enquiries on a daily basis and has an excellent record for converting the majority of enquiries into confirmed appointments. They also work with several leading letting agents and property management companies...... click apply for full job details"
  },
  {
    "": "Vacancy for\n\nEarly Years / Childcare Apprenticeship Tutor - Freelance\n\nSalary: Intervention payments per learner\nLocation: London\n\nAbout Us\n\nWould you like to be a part of the UK’s leading education and wellbeing charity, and arguably the most recognisable and iconic of all charity brands? YMCA Training has some exciting opportunities for Freelance Early Years / Childcare Apprenticeship Tutors to join our team in London. This is a perfect opportunity for an Early Years / Childcare specialist to deliver inspirational programmes that engage and motivate our learners to progress and achieve.\n\nAbout the Role\n\nIf you’re looking to start or to grow your own business, or supplement your income, this should be interesting to you. The role involves:\n\n- Managing apprenticeships for the lifecycle of their programme, from sign-up to qualification, including all associated administration\n\n- Robustly assessing and develop learner competency for a range of qualifications\n\n- Providing training for... all components throughout the apprenticeship, in line with our quality standards\n\n- Working with current and prospective employers to identify and secure additional apprenticeship opportunities\n\nAbout You\n• Excellent communication skills and great rapport building ability. This will help you not only to support our learners, but to engage with employers about each learner’s progress, as well as to explore new opportunities.\n• Highly organised, with demonstrated planning and time-management skills (supported by good IT skills)\n• Qualification in a range of Childcare disciplines\n• A recognised teaching qualification\n• A1 assessor or equivalent qualification.\n\nThis could be your chance to join our innovative team and to do something great for yourself – and for others. If this sounds right for you, click apply today and tell us why you are the perfect candidate for this role!\n\nWe look forward to hearing from you!\n\nCentral YMCA is committed to championing equality, diversity and inclusion in all its forms. For those who would like to work with us, Central YMCA welcomes applications from all sections of society. We believe that our Charity is greatly enhanced by the varied backgrounds, experiences and views represented within our team; we aim to appoint individuals based solely on their applicable skills, experience and attitudes.\n\nCentral YMCA champions a culture of vigilance and seeks to identify and protect children, young people and adults at risk. As a provider of education and training programs, particularly for young people, Central YMCA takes our responsibility extremely seriously.\n\nFor any individual who will be working, volunteering or freelancing with us, all recruitment and engagement processes will include pre-employment checks (including referencing and an appropriate level of disclosure via the Disclosure and Barring Service).\n\nWe also ensure that all subcontractors and agencies are appropriately vetted"
  },
  {
    "": "Job Title: Freelance Event Technician London\n\nBecome an In2 Freelancer!\n\nWe have seen an increase in the number of requests for flexible short-term cover and long-term 3, 6 or 12 months contract assignments with our AV clientele.\n\nWe are actively seeking freelance AV Event Technicians across the whole of the UK to work on-site at Financial institutions and large corporate customer sites covering the busy summer period.\n\nSuitable candidates will be available for a quick start and have customer facing, corporate experience providing technical support involving all aspects of audio visual events set up and support.\n\nOur contract / freelance roles would suit a seasoned freelancer looking for additional days/weeks work, or alternatively, someone in between jobs or out of work looking for a short to medium term solution.\n\nPlease note, actual day rates are dependant on specific site and experience/skill-set of workers.\n\nDesired AV Events Technician experience:\n\nAudio:\n\nExperience using... Digital desks such as Cl series, QL series, LS9, M7CL ,etc\n\nKnowledge of industry standard radio mics ( i.e Shure ULXD ) - Some RF theory handy\n\nAudio to/from webcast, video conference and phone lines - Town hall scenario webcasts and video conference calls\n\nLiaising with call operators\n\nMixing live audio for multiple presenters, panel sessions and high profile speakers - using multiple mics for resilience\n\nAvoiding audio 'ring' in challenging audio environments\n\nCorrectly putting mics on presenters/Dealing with high profile presenters Video:\n\nExperience with vision mixing, use of industry standard vision mixers\n\nMixing to multiple outputs such as video conference and presentation screens simultaneously. Using auxes\n\nSetting camera shots and operation of remotely controlled cameras\n\nPlaying videos from playback pro\n\nMixing between multiple video and presentation sources. Use of backups for resilience\n\nKnowledge of power point/ Adobe presentations\n\nKnowledge of Scalers - such as Analogway/Broadscan\n\nPatching via a video matrix - some knowledge of video standards Control: Some knowledge of Crestron/Extron/AMX processors and touch panels for patching of audio and video signals\n\nLighting: Any lighting experience welcomed but not essential.\n\nThe above is a very basic breakdown of some of the day to day skills required of an experienced event technician, but are not all essential. Generally, a few of these skills combined is enough and the rest can be taught.\n\nIn2 Resourcing have decades of experience running temporary recruitment desks. We provide prompt weekly payment and full support with company formation or umbrella payroll set-up as well as contract compliance"
  },
  {
    "": "Freelance Crestron Programmer/Engineer\n\nCrestron Programmer/Engineer | Private Refurbishment | France | Freelance | High End\n\nA private client of mine is currently seeking a Crestron Programmer/Engineer with an electrical background to work on a private refurbishment in the south of France.\n\nThe successful Crestron Programmer/Engineer will have extensive experience working on high-end residential refurbishment projects installing and designing audio visual systems. The Crestron Programmer/Engineer will be able to communicate effectively in both English and French, being able to converse in polish will be advantageous. The Crestron Programmer/Engineer will have access to free on-site accommodation, with some travel expenses also being covered by the client.\n\nRequirements\n• Design and install AVS as per the clients requirements\n• Program, troubleshoot and update software to deliver system performance and ease of access for non-technical users\n• System design and engineering experience\n•... Crestron Certified Programmer\n\nRole: Crestron Programmer/Engineer\n\nLocation: St Tropez / South of France\n\nSectors: Construction - High End Residential\n\nDay Rate: Â£Neg DOE (accommodation is covered)\n\nReference: SH8288\n\nIf you are a Crestron Programmer/Engineer, looking at your career options, then please call Sam Hughes at Brandon James.\n\n\n\nCreston Programmer/Engineer | Private Refurbishment | France | Freelance | High End\n\nRequired Qualifications\n• None"
  },
  {
    "": "Part-time Digital Copywriter needed to work with Digital Designer in established start up! (Recruiting for both roles)\n\nFreelance Digital Writer - Up to £250 per day PAYE - 3 month contract - London\n\nTHE COMPANY\n\nCentral London based fintech with entrepreneurial but established business model, and an in house creative team of 4, needs a freelance Digital Writer to support business growth and volume of work.\n\nTHE ROLE\n\nYou will sit in the team who are responsible for demand generation and this results in digital ad copy and digital ad imagery for online banners, display and LinkedIn ads.\nIn terms of copy, you will write across landing pages and emails predominantly. The landing pages will be likely be built on instapage. There is also the requirement for some templates to be created for marketing use over the next few months designed with the marketing automation guys there. Yourself and the Designer may produce other marketing collateral, print ads and supporting work for... events.\n\nYOU\n\nThe two roles we are recruiting for could be a team used to working with each other or two individuals who can collaborate.\nWorking with the designer you will curate compelling, engaging work resulting in conversion.\n\nWe need creatives' who can understand how to convert and drive click through to landing pages.\n\nPlease apply if this seems like the right part time role for you! We would love to see a strong portfolio of work.\n\nFreelance Digital Writer - Up to £250 per day PAYE - 3 month contract - London\n\nIf this role isn't what you're looking for don't worry. At Stopgap we cover all permanent and freelance marketing positions, with specialist industry sector teams. You can check out all of our roles on our website and sign up for job alerts so you're the first to know about a new opportunity . Marketing Recruitment - The Stopgap Way"
  },
  {
    "": "Who are UpSkill Digital?\n\nUpSkill Digital deliver engaging, innovative and inspiring on-brand training solutions both digitally and face-to-face for and on behalf of many of the world’s largest brands. Our clients include Google, Apple, Lloyds Banking Group and Beats to name just a few. We’re bringing an exciting new programme to San Francisco, San Diego, New York, Nashville and Chicago with one of our top clients and are looking for some world-class digital training experts to join our team!\n\nSounds interesting, what’s the role?\n\nWe're working with one of our biggest clients to bring an inspiring and transformational digital skills programme to, specifically aimed at engaging hard-to-reach groups. Can you excite and educate audiences about digital tools and technologies? Are you passionate about improving lives and driving productivity through digital skills? Are you excited about putting people at the heart of the digital revolution and making sure no one gets left behind? If the... answer is ‘yes’, then we’d love to hear from you.\n\nAnd what is it that you’re really looking for?\n\nWe’re committed to working with the best in the business.\n\nWe're looking for best-in-class digital experts and advocates. Charismatic and self-motivated, you’ll be a natural at educating people whilst making them feel like there is nothing you can't help them with.\n\nYou’ll be confident with digital tools and experienced in the digital or tech industry. Most importantly, you’ll be a passionate freelancer who has the flexibility to work on different campaigns, both immediately and in the future.\n\nYou will assist in training and mentoring the public with digital skills development and coaching for one of our biggest brands with potential to move across to other projects too.\n\nWe’re on the lookout for freelance Digital Skills Coaches who are based in or around San Francisco, San Diego, New York, Nashville and Chicago.\n\nMust-haves\n\nProven digital expertise\n\nA flair for educating and engaging audiences\n\nLive in the USA ( San Francisco, San Diego, New York, Nashville and Chicago )\n\nHave good availability for flexible work across the next 3 months\n\nWhat you’ll get if you work for us\n\nBest in class training sessions, run both remotely and face to face\n\nUnparalleled support from our head office team\n\nEngaging work with an exciting roster of clients\n\nThe opportunity to meet and work alongside like-minded individuals\n\nMake a real difference to the world of education and transform people’s lives with digital skills\n\nExtremely competitive rates of pay with quick payment terms\n\nSounds great, how do I get involved?\n\nIf you've made it this far and are as excited as we are about digital skills training, then hit apply now via the link; https://upskilldigital.shortlist.co/job-openings/11/.\n\nNext steps; If we think you've got what it takes we'll ask you to send us a video of you training us in something digital then we'll schedule a remote interview. If successful you will be invited to a training workshop in the new year.\n\nJob Type: Contract"
  },
  {
    "": "Job Introduction\n\nBBC World News is the BBC’s most watched TV channel – viewed by nearly 100 million people a week and available in more than 300 million households around the world.\n\nThe BBC has been committed to journalistic excellence for more than 80 years. BBC News aims to provide access to the information and ideas everyone needs to make sense of an increasingly complex world on whatever platform they chose. Through its emphasis on specialist knowledge, international newsgathering and its breadth of programmes, BBC News seeks to deliver a complete news package, covering arts, science, sports, politics, business and world affairs. With its team of 2,000 highly trained journalists and over 40 news bureaux, BBC News strives to bring impartial and trusted news reporting to audiences all over the globe.\nRole Responsibility\n\nWe’re creating a talent pool of producers on a freelance basis who we can contact to work with us at peak times.\n\nYou’ll work effectively as part of the team... within BBC World News as directed on a variety of duties: writing and producing world news stories for TV using text, stills, video and graphics; gathering and working on information from various sources such as UGC and social media; writing headlines, structuring sequences and stories and working on OBs if required; contributing to the planning and origination of new angles and stories.\nAre you the right candidate?\n\nYou will need a good knowledge of our editorial agenda, sharp production and writing skills and be able to respond to a fast-moving news environment. Candidates should enjoy working under pressure and bring plenty of story, contributor and production ideas to the role. You will be expected to work across our platforms and have an understanding of the different production methods as well as audience needs. You will be comfortable with technology and social media, able quickly to pick up new skills and turn ideas into engaging coverage. You will need a thorough understanding of the BBC’s editorial guidelines and values or the ability to pick this up quickly.\n\nAssessments are expected to take place in April 2020. Those successful after the Assessments will be invited to an interview.\n\nPlease note that you are required to complete a tailored application questionnaire as well as your CV. Please keep to the word count for each of the questions were specified.\nPackage Description\n\nAll opportunities offered, as a result of appointment to this talent pool, will be on a Freelance PAYE basis.\n\nAppointment to the Talent Pool will not entitle candidates to a permanent contract in the BBC, those will have to be applied for in the normal way, and neither does it guarantee work. However, it may lead to consideration for broader freelance opportunities across BBC News.\n\nAny freelance work offered will be carried out at our New Broadcasting House office in Portland Place, London, W1A 1AA.\n\nIf you already have a current staff contract with the BBC (continuing or fixed term), you won’t be eligible to apply.\n\nAny work offered with the BBC will be conditional upon you having the right to work in the UK.\nAbout the BBC\n\nWe don’t focus simply on what we do – we also care how we do it. Our values and the way we behave are important to us. Please make sure you’ve read about our values and behaviours in the document attached below.\n\nDiversity matters at the BBC. We have a working environment where we value and respect every individual's unique contribution, enabling all of our employees to thrive and achieve their full potential.\n\nWe want to attract the broadest range of talented people to be part of the BBC – whether that’s to contribute to our programming or our wide range of non-production roles. The more diverse our workforce, the better able we are to respond to and reflect our audiences in all their diversity.\n\nWe are committed to equality of opportunity and welcome applications from individuals, regardless of age, gender, ethnicity, disability, sexual orientation, gender identity, socio-economic background, religion and/or belief. We will consider flexible working requests for all roles, unless operational requirements prevent otherwise.\n\nTo find out more about Diversity and Inclusion at the BBC, please click here\n\nBBC"
  },
  {
    "": "Description Social Media and Branding Coordinator (Freelance)We are looking for a creative Social Media and Branding Coordinator, to work on a freelance basis with Rock + Raw Jewellery; a fast growing London based crystal fine jewellery company.Hours: Flexible\n\nPaid hourly\n\nExpected time commitment up to10.5 hours per week.About + Raw is a fast-growing London-based crystal fine jewellery company.We source the finest crystals on the planet and set them in solid gold, incorporating ritual, meditation and ceremony.Our creations are aimed to inspire a sense of awe, healing, joy and transformation\n\nWe aim to achieve the impossible\n\nWe go above and beyond to exceed our customers’ expectations and provide the best experience possible\n\nWe’re always growing, within ourselves, our roles, and as an organisation, and we infuse everything we do with kindness.About successful candidate will: Have a natural affinity for creating beauty and strong understanding of our minimalist aesthetic\n\nBe... passionate, keen and able to pursue projects independently Have a keen eye for detail, and a love of Instagram/social media Be up to date on social media best practices, e.g\n\nhashtags, product tagging, how to optimise posts for Instagram’s algorithm, etc\n\nHave an interest in spiritual practice and ability to speak to our audience in a spiritual way, consistent with our Rock + Raw tone of voice Have an understanding of what makes successful wellness and luxury brands tick Have proven experience with managing accounts of luxury and/or wellness brands Excellent copywriting skills Ability to deliver best-in-class creative content – images and videos Advanced knowledge of photo editing tools such as Photoshop considered as a plus Responsibilities: Creating beautiful on-brand content, both visual content and written content (i.e\n\ncaptions) Capturing content Posting content on our social media feeds on a daily basis (primarily, Instagram grid and stories) Create and implement a content editorial calendar in line with brand guidelines and planned marketing campaigns Listen, respond, ask questions to engage the audience, and actively increase its size Keep track and curate consumer generated content, with an emphasis on influencers and celebrities wearing Rock + Raw Collaborate with other team members to ensure brand consistency To send an email to our Founder CEO Lucy (via the link above) with your CV, cover letter and a link to your own Instagram pageClosing date 12th March"
  },
  {
    "": "SITE MANAGER LOCATION: LONDON SALARY: £(Apply online only) per day Capstone Recruitment are currently working with a construction company on the refurbishment of a theatre in London\n\nThis is a large multi-million pound refurbishment and due to complete within 4 months\n\nSite Managers Site based, 8am to 6pm, plus weekend as required\n\nSMSTS and first aid qualified with 10 years UK experience\n\nExperience with heritage buildings Experience in Construction Management preferred\n\nKnowledge of JCT form of contract Experienced with Microsoft Outlook, Excel, Powerpoint and Word\n\nGood standard of written English including basic report writing\n\nMust provide own Windows laptop and mobile phone for business use\n\nJob Description Site based role monitoring all construction H&S, progress and quality aspects of a the works\n\nThe role will be reporting directly to the Construction Manager whilst working closely with large multidisciplinary team\n\nDuties will include; Record keeping and reporting of the... construction process Liaison with all contractors on site Solving logistic and co-ordination issues\n\nCo-ordination with the Theatre and Design Teams Chairing and recording progress and co-ordination meetings Development and close monitoring of detailed work programmes and schedules\n\nAssessment of RAMS and monitoring of implementation\n\nPreparation of weekly progress reports including photos and programme drop lines If you're interested, please get in touch below: (phone number removed) (phone number removed) (url removed) Transparency Notice to Prospective Candidates We process certain personal information about you for our legitimate business interests in order to identify and contact suitable candidates about positions that may be relevant to them\n\nAt Capstone Property Recruitment Ltd we respect your Privacy details all of which are set out in our Privacy Policy on our website at (url removed) .If you don't want to be contacted by us about potential positions that may be of interest to you in the future, then please email our Data Protection Officer at"
  },
  {
    "": "This company is a property maintenance provider in the UK covering London and South East England. This company generates a large volume of customer enquiries on a daily basis and has an excellent record for converting the majority of enquiries into confirmed appointments. They also work with several leading letting agents and property management companies...... click apply for full job details"
  },
  {
    "": "Requirements 4+ years construction experience Main Contractor Experience Industrial Shed Experience Immediate Start Role: Design Manager Location : Glasgow (Home based flexibilty) Sectors: Industrial Duration: 7 MONTHS Day Rate: £330 (Depending on Experience) If you are a Design Manager and match the description above, please get in contact with Luke Carroll at Brandon James\n\nRef: LC5214 Freelance | Design Manager | Industrial | National | Main Contractor"
  },
  {
    "": "Our schools are stuck. Teachers are forced to sacrifice real education for exam preparation, while students are left overworked and disappointed with their results.\n\nAt Up Learn we use AI and cognitive science to ensure every student can achieve an A*, regardless of their background. Our mission is to provide the world's most effective learning experience, and in doing so, help every student fulfil their potential.\n\nLast year, 100% of the students who completed our course in A Level Economics achieved A or A* grades, with some starting from grades as low as Ds and even Us.\n\nWe’ve now raised two and a half million pounds to create our next wave of A Level and GCSE courses, expanding our reach to 2 million new students every year.\n\nCore Responsibilities\n\nAs a freelance Up Learn Content Developer, you will play an integral role in helping to build the course content for the various subjects. We are currently building courses for Maths, Economics, Physics and Psychology and are looking... for content developers to join us and help shape our courses in each of these subjects.\n\nYou will be responsible for:\n• Sequencing and developing quizzes and exam questions at a range of difficulties to help students practice and internalise concepts\n• Using existing and creating new frameworks for quizzes to create effective questions\n• Writing crystal clear explanations and solutions\n\nRequirements\n• You’re passionate about education and want to be part of an ambitious project with the potential to have an impact on millions of people\n• You have extremely strong command of the content covered in your chosen A Level subject (on one or more exam boards), demonstrated by an outstanding academic track record\n• You have impeccable written communication skills\n• You have an eye for detail and excellent time management skills\n• You have strong empathy for others, particularly students\n• You value an extremely high quality team\n\nBenefits\n• Competitive pay\n• The chance to define the future of education and make a meaningful contribution to the lives of thousands of students\n• A fun, high-caliber team that trusts you and gives you the freedom to be brilliant\n• Professional training on effective teaching and how to produce world-class content\n• Work with other exceptional teachers and tutors and a professional production team to bring your content to life\n\nRole structure\n• Paid per group of quizzes produced, at £15-30 per hour depending on the speed you work\n• Remote, freelance role\n• Must have a minimum of 8 hours per week available\n• Flexible hours / no commute\n• Must be available to start immediately\n• You will specialise in ONE subject: Maths, Physics, Economics or Psychology.\n\nApply by clicking the button below to submit your CV and a no-nonsense, no-waffle bullet point cover letter. Tell us why you’re applying and why you.\n\nDeadline: We are accepting applications for all subjects on a rolling basis. When all positions are filled, applications will be closed"
  },
  {
    "": "Job DescriptionFreelance - immediate start Location Notting Hill, London with adhoc travel to Bristol (1 day) The OVO Group's mission is to drive progress towards net zero carbon living. To reach zero, we need everyone to come together. Not as customers buying energy, but as members with a common goal. When we launched in 2009, we set out to make energy better. We brought great service, clear information and honesty to the industry. These days our sights are set higher. The climate crisis is humanity's greatest challenge. The energy you use at home is responsible for 26% of your carbon footprint, so as an energy supplier, we've got a responsibility to help fix that. That's why we're on a journey with our members to reach a world where our net carbon emissions equal zero. We call it zero-carbon living. Where in the world of OVO will I be working and what will I be doing? The Brand Marketing Manager will support the Senior Brand Marketing Manager and Head of Brand in executing and... optimising the 2020 strategy by:\n• Having a broad understanding of the brand strategy, how it should be executed and expressed. Able to confidently assess whether a piece of comms is \"on brand\" from a visual, tonal and messaging perspective and to work with Lead/ Senior to guide it to better place if it needs it.\n• Supporting the Senior Brand Marketing Manager on the delivery of fully integrated brand campaigns including ATL, social, PR and TTL. Helping to coordinate all internal and agency meetings, collating feedback and clearly communicating feedback. Competent with the detail of media plans, ensuring the on-going optimisation and measurement of campaigns across channels.\n• Leading on specific smaller projects / campaigns. Examples of this would be a tactical PR campaign (e.g. I Dig Trees). Or another burst of media activity where existing assets are being adapted versus created from scratch. Or the application of brand guidelines/ TOV across new user journeys.\n• Delivery and co-management of the blog strategy (with the social media manager) including writing of content where appropriate and optimisation in line with commercial objectives.\n• Support the social media manager with social agency management and performance optimisation.\n• Monitoring competitor and wider brand activity. Sharing in formal regular reviews as well as ad-hoc.\n• Supporting Lead/ Senior in coordination of key agency/ internal meetings, sharing of information and circulating actions/ notes as required.\n• Application of new ways of working processes and proactive communication to counter-parts of process changes when necessary. The Brand Marketing Manager will be an integral part of our lean, high performing team at OVO Energy and will be given the support and training needed to develop their skills and confidence. Is this the job for me? The Brand Marketing Manager for OVO Energy should be experienced at supporting the development and execution of brand marketing campaigns. You will be looking for that next step in your career, managing autonomous campaign delivery at a manager level. Energy category experience is not essential however experience working with fast-paced brands would be very beneficial. You will understand how to use brand strategy to execute effective brand marketing campaigns and have experience helping to build distinctive and unifying brand worlds across every customer touchpoint. You will have great creative instincts as well as impressive organisation/ project management skills. You could have honed these skills from time spent at amazing integrated creative agencies or in-house for highly strategic and ambitious brands. You will have experience managing multiple stakeholders to ensure that projects are delivered on time and on budget and you will be adept at \"upwards management\" ensuring the right people are engaged at the right times. Ultimately, you will be someone who brings energy and positivity to the team and who is inspired by the zero carbon living journey that OVO is on with its members. You will also need the confidence and competence to hold your own in a business full of high-performing, strong characters. OVO believes in fueling human progress with clean and abundant energy for all. We were set up to always find a better way and challenge the status quo. Diverse teams are the best teams We're keen to meet people with varied backgrounds: the more inclusive we are the better our work will be. We want to build a team which represents a variety of backgrounds, perspectives, and skills, and we decide employment on the basis of merit and potential. We understand some people may not apply to jobs unless they tick every box. If you're excited about joining us and think you have much of what we're looking for, even if you're not 100% sure... we'd love to hear from you"
  },
  {
    "": "Job Profile Teaching - Business Tutor\nContract Type Freelance\n\nJob Purpose\n\nLondon – Shepherd’s Bush and/or London City campus\n\n(Online, live delivery may also be a requirement of the role)\n\nBPP's School of Business & Technology is recruiting for Associate faculty roles to accommodate the demand needs within the School across our Degree and Apprenticeship programmes.\n\nWe are looking for highly motivated, practitioner-experienced lecturers to bring high quality teaching, content creation and module leadership into the School in this area.\n\nWe are interested in practitioners from various commercial sectors.\n\nJob Background\n\nThe role of the faculty within the School is to develop, co-ordinate and deliver engaging teaching and learning materials (across Levels 4 to 7) to ensure that learners within the School receive a premium education and learning experience.\n\nThe key duties of Associate Faculty on these programmes will be teaching (mainly face to face, however there could be a... requirement for a mixture of live, online delivery via our Adobe Connect platform on some programmes), module leadership and module material development. There is also the opportunity to undertake a variety of additional duties including, but not restricted to assessment marking and project supervision across the wider School.\n\nKey Responsibilities:\n\nTeaching, Module Leadership and Module Development\n• Be accountable for high quality module learning and resource development, using relevant professional syllabus material to create high quality, engaging teaching and learning materials, including formative multiple choice and other assessment materials.\n• Develop and deliver high quality and consistent teaching materials including detailed schemes of work, topic guidance, activity checklists, content, (including webinar slides and resources). Delivery in a face to face capacity, can be a combination of 2-3 hour segments across the working day or on weekday evenings depending on the programmes and modules taught. Could also be an online delivery requirement on some of our programmes.\n• Provide high quality module leadership and be accountable for the standard of the module materials and resources. Ensure high quality and consistent teaching through the provision of detailed teaching guidance and academic support.\n\nAdditional roles\n• Examining, assessment and marking within the relevant programmes.\n• Supervising student projects within the relevant programmes.\n\nDepartment School of Business and Technology - SOBAT Faculty\nLocation UK, London, London Fitzwilliam House\n\nCandidate Criteria\n\nEssential\n• Relevant first degree and/or Professional Qualification(s) applicable to your subject area and level of teaching.\n• Significant practitioner experience relevant to the discipline\n• Experience of negotiation with and managing different stakeholders\n• Excellent written and verbal communication skills\n• Excellent presentation skills\n• Commercially and educationally focussed with leadership and coaching skills\n• The ability to effectively plan, organise and prioritise workload\n• The ability to work well in a team and be collaborative\n• Excellent computer/IT skills\n• Self-motivated\n\nPlease note successful candidates will be required to undergo a DBS check\n\nDesirable\n• A teaching qualification relevant to the discipline; or Fellowship of the HEA; or a commitment to achieving either of these through BPP's PGCLT (Post Graduate Certificate in Learning & Teaching) or Headway, BPP's accredited CPD scheme\n• Other industry related professional accreditations and/or certifications\n• Experience of teaching the subject at a Further (Level 3) and/or Higher (Levels 4-7) Education level\n• Experience in teaching live online and/or of delivering training and seminars in a commercial context\n• Experience in developing schemes of work and engaging online content\n• Experience of providing guidance and leadership to a teaching team\n• Experience/awareness of delivery needs for work based learners\n• Experience of supporting students\n\nEmployment Details\n\nContract Hours Freelance\nFTE Freelance\nSalary Competitive\n\nAttachments\n\nFull Job Description\n\nFreelance Tutors - Risk Governance.pdf (316 Kb"
  },
  {
    "": "About You.\n\nYou’re a Technical Project Manager from a digital agency background who has detailed experience of using Waterfall and Agile.\n\nYou’ve got the experience, knowledge and personal skills to manage projects in an objective, professional and confident manner. You’ve delivered digital products and digital marketing initiatives before and the idea of finding a role that allows you to work remotely on part time basis would be perfect!\n\nAbout the Role.\n\nWe’re looking for someone who has a digital agency background, someone who has great people skills and who is used to working with high end clients. Communication with our clients is key so you’ll be able to demonstrate confidence when presenting to mid-level client groups or when leading large Client and Agency team discussions\n\nYou’ll be a whizz at the reporting side of things and have a consultative approach, you know what is important and when.\n\nYou’ll be able to draw upon your digital project experience to identify risks... throughout the duration of projects and can respond effectively to client questions and will be able to set clear expectations for timing to complete requests.\n\nThere’s a lot to this role, but here’s a taster of what you’ll be involved in:\n• You’ll work closely with clients to define production guidelines and will provide budget advice and advice on communication, ensuring that the guidelines each of our client’s provide is followed.\n• You’ll evaluate digital production Statements of Work (SOWs) from agencies to clarify what should be delivered and when for each project. You’ll identify any missing or incomplete sections that may impact the delivery and cost of the project and will make recommendations based on digital project documentation best practice and mandatory attributes.\n• You’ll review project timelines based upon the expectations of clients and will review cycles.\n• You’ll review the project breakdown of agency resource allocation and production costs and recommend approaches to reduce costs where appropriate without sacrificing quality of production or creative/ technical integrity.\n• You’ll review project change requests and help to educate the Client on trade-offs.\n• Reviews cost model and advises client on change if recommended\n\nYou’ll have the people skills to fit seamlessly into the team and our clients in a positive, professional and constructive way, establishing solid relationships and trust.\n\nIf this appeals and matches your work background, plus you’d like to work on a long term, part time, freelance basis on a remote basis, get in touch, we’d love to hear from you"
  },
  {
    "": "Job Profile Teaching - Technology Tutor\n\nContract Type Freelance\n\nJob Purpose\n\nThis role will be online based - live delivery\n\nBPP's School of Business & Technology is recruiting for Associate faculty roles to accommodate the demand needs within the School across our Degree and Apprenticeship programmes.\n\nWe are looking for highly motivated, practitioner-experienced lecturers to bring high quality teaching, content creation and module leadership into the School in this area.\n\nWe are interested in practitioners from various commercial sectors with experience and/or certification in Apache Spark, to support on our MSc Applied Data Science programme.\n\nJob Background\n\nThe role of the faculty within the School is to develop, co-ordinate and deliver engaging teaching and learning materials (across Levels 4 to 7) to ensure that learners within the School receive a premium education and learning experience.\n\nThe key duties of Associate Faculty on these programmes will be teaching (mainly... online live delivery, via our Adobe Connect platform), module leadership and module material development. There is also the opportunity to undertake a variety of additional duties including, but not restricted to assessment marking and project supervision across the wider School.\n\nKey Responsibilities:\n\nTeaching, Module Leadership and Module Development\n• Be accountable for high quality module learning and resource development, using relevant professional syllabus material to create high quality, engaging teaching and learning materials, including formative multiple choice and other assessment materials.\n• Develop and deliver high quality and consistent teaching materials including detailed schemes of work, topic guidance, activity checklists, content, (including webinar slides and resources). Delivery can be a combination of 2-3 hour segments across the working day or on weekday evenings depending on the programmes and modules taught.\n• Provide high quality module leadership and be accountable for the standard of the module materials and resources. Ensure high quality and consistent teaching through the provision of detailed teaching guidance and academic support.\n\nAdditional roles\n• Examining, assessment and marking within the relevant programmes.\n• Supervising student projects within the relevant programmes.\n\nDepartment School of Business and Technology - SOBAT Faculty\n\nLocation UK, Home Based, Home Based\n\nCandidate Criteria\n\nEssential\n• Relevant first degree and/or Professional Qualification(s) applicable to your subject area and level of teaching\n• Apache Spark experience and/or certification\n• Significant practitioner experience relevant to the discipline\n• Experience of negotiation with and managing different stakeholders\n• Excellent written and verbal communication skills\n• Excellent presentation skills\n• Commercially and educationally focussed with leadership and coaching skills\n• The ability to effectively plan, organise and prioritise workload\n• The ability to work well in a team and be collaborative\n• Excellent computer/IT skills\n\nPlease note successful candidates will be required to undergo a DBS check\n\nDesirable\n• A teaching qualification relevant to the discipline; or Fellowship of the HEA; or a commitment to achieving either of these through BPP's PGCLT (Post Graduate Certificate in Learning & Teaching) or Headway, BPP's accredited CPD scheme\n• Other industry related professional accreditations and/or certifications\n• Experience of teaching the subject at a Further (Level 3) and/or Higher (Levels 4-7) Education level\n• Experience in teaching live online and/or of delivering training and seminars\n• Experience in developing schemes of work and engaging online content\n• Experience of providing guidance and leadership to a teaching team\n• Experience/awareness of delivery needs for work based learners\n• Experience of supporting students in an academic context\n\nEmployment Details\n\nContract Hours Freelance\n\nFTE Freelance\n\nSalary Competitive\n\nAttachments\n\nFull Job Description\n\nFreelance Tutors - Apache Sparke.pdf (315 Kb"
  },
  {
    "": "Job Vacancy: Freelance Satellite Facilities Coordinators - Al Jazeera English\n\nLocation: London, UK\n\nAl Jazeera English would like to hear from all experienced Freelance Satellite Facilities Coordinators who are interested in working on an adhoc basis at our London Broadcast Centre.\n\nFulfilling a key role at the core of the stations technical facilities, you will be responsible for managing and coordinating the booking of satellite, fibre and COFDM facilities for live on-air production using ScheduALL. A comprehensive understanding of a live 24 hour news environment and a working knowledge of satellite communication technology and broadcast standards is essential.\n\nEXPERIENCE LEVEL REQUIRED:\n\nDemonstrable professional experience in a satellite booking role or related field\n\nHigh standard of written English\n\nAdditional languages would be beneficialA demonstrable passion for News & Current AffairsPlease send your CV to:\n\nPosted on TVZ: 10th March 2020"
  },
  {
    "": "Freelance Project Manager - #Creative #Design #Studio needed ASAP. The client: Global beauty brand based in London The role: Creative Studio PM with Traffic and Production experience The brief: My client is looking for a Project Managers to support their busy creative studio to run entire projects from ideation to delivery - managing timings, workflow and multiple stakeholders across the business and the creative team. The dates could potentially span between 3 - 6 months and start ASAP. The person: A Project Manager who has worked in studios, or creative services environments. Ideally with Traffic and Production experience. 200 to 250 per day DOE. Creative Recruitment is an equal opportunity employer and do not discriminate based on race, religion, gender, age, sexuality, gender identification, or physical ability."
  },
  {
    "": "Freelance Consumer Senior Account Director/Associate Director\nFreelance Consumer Senior Account Director/Associate Director Worlds No.1 Agency London – 250-300 Day Rate 4 Days a week – October Start\nMy client is the No1 ranked global communications agency that partners with many of the worlds largest and emerging brands and organizations. They were awarded the Grand Prix Cannes Lion for PR in 2014; six Cannes Lions in 2015 and named 2016 Global Agency of the Year by the Holmes Report.\nMy client is now seeking a freelance Senior Account Director/Associate Director to join the consumer team. This will be to work on one of, if not the biggest, global consumer health and beauty brand. October start until the end of December on a 4 day a week contract.\nThe ideal candidate for this role will have/be:\nStrong consumer experience from top-tier agencies working on big, global brands\nPrevious work on global toolkits\nWorked at Senior Account Director/Associate Director level\nThe right level of... creativity and media expertise, to tell compelling stories about patients and consumers health and well-being.\nAble to mix creativity and science to engineer impactful informative experiences that inspire action and positive outcomes.\nThis is a superb opportunity to join the very best agency around. My client offers a day rate from 250 to 300 depending on experience. This is a 4 day a week role starting October.\nLocation\nLondon\nSalary\n300 GBP\nJob Type\nFreelance/Agency\nIndustry\nConsumer"
  },
  {
    "": "A part time Vetigraph pattern cutter with solid Vetigraph experience is required to join this a fast paced London womenswear supplier. You will be working with high street retailers on women’s jersey and woven product creating all 1st patterns and amendments.\n\nThe role requires a pattern cutters who will work quickly and efficiently to ensure quality products.\n\nThe Role:\n• Working closely with Design to create 1st patterns on the Vetigrpah pattern cutting system\n• Ensuring that patterns are produced to the required standard\n• Providing the necessary information to the manufacturing base in terms of spec sheets and make up methods.\n• Ensure consistency of sizing across all products.\n• Presenting ranges in meetings.\n\nCreative Pattern Cutter - The Candidate:\n• Experienced pattern cutter with Vetigraph\n• Previous women's jersey and woven experience ideally within a supplier environment.\n• Experience working in a fast paced environment.\n\nThis role is to work 2-3 days per week on an... on-going basis. If you have suitable experience as a Vetigraph pattern cutter and looking for a new challenge this could be the role for you! Apply now"
  },
  {
    "": "Nalla\n\nMain Duties\n\nOur company is looking for a Freelance Graphic Designer. You must be passionate and creative with your work. You will design and edit current branding for the packaging.\n\nYou may have the possibility of future work.\n\nSkills and Experience\n• Have knowledge of cosmetics and skincare is a bonus\n• You should have knowledge of branding\n• You should have Adobe illustrator and/or indesign"
  },
  {
    "": "Freelance Recruitment Business Development Manager\n\nSupported by the UK's fastest growing network of recruiters\n\nEarn up to 60% commission on placements - OTE £100k+ p.a.\n\nHave you been running your own desk?\nIs the commute getting you down? Would you prefer to work your own ours from anywhere?\nHave you got the Clients and want to feel confident the roles are going to be filled?\n\nThis is where Recruiterlink come in! We have over 50 experienced recruiters (specialising in all major sectors) working with us. They have access to all the major UK job boards and the very latest in talent attraction software!\n\nDon't take the risk and go it alone, partner up with Recruiterlink and we will provide you the candidates to maintain your Client relationships today.\nAll that is needed is Non-disclosure/compete agreements signed upon introduction so along with our performance you have peace of mind that whatever you have built, we will enable you to continue growing.\n\nAbout... RecruiterLink:\n\nRecruiterlink offers an unrivalled opportunity for ambitious, self-motivated recruitment sales professionals to build a successful business, increase their earning and strike a better work/life balance.\nUsing our proven platform and methodology, you can secure new clients for our network of expert recruiters on a generous fee share.\nRecruiterlink provides you with all the tools and support you need to maintain and sustain your new position, there are NO FEES OR SETUP COSTS!\n\nBenefits:\n\nNo hard sell, no upfront fee\nWork your own hours\nOperate from anywhere\nUnique Platform\nUnlimited new prospects\nFull sales support\nUnlimited and uncapped earnings\n\nThis is a unique opportunity for someone to really make their mark and take ownership of their income as well as their future.\n\nIf you are ready to take that next step, drop me an email at , call me on (phone number removed) or apply through this advert for more information.\n\nBy applying for this role you accept the Jobzooma terms and conditions that can be found on our website and agree to receive email notification of other suitable jobs\nRole: Freelance Recruitment Business Development Manager\nJob Type: Contract\nLocation: London, Greater London,\n\nApply for this job now"
  },
  {
    "": "Freelance Recruitment Business Development Manager\n\nSupported by the UK's fastest growing network of recruiters\n\nEarn up to 60% commission on placements - OTE £100k+ p.a.\n\nHave you been running your own desk?\nIs the commute getting you down? Would you prefer to work your own ours from anywhere?\nHave you got the Clients and want to feel confident the roles are going to be filled?\n\nThis is where Recruiterlink come in! We have over 50 experienced recruiters (specialising in all major sectors) working with us. They have access to all the major UK job boards and the very latest in talent attraction software!\n\nDon't take the risk and go it alone, partner up with Recruiterlink and we will provide you the candidates to maintain your Client relationships today.\nAll that is needed is Non-disclosure/compete agreements signed upon introduction so along with our performance you have peace of mind that whatever you have built, we will enable you to continue growing.\n\nAbout... RecruiterLink:\n\nRecruiterlink offers an unrivalled opportunity for ambitious, self-motivated recruitment sales professionals to build a successful business, increase their earning and strike a better work/life balance.\nUsing our proven platform and methodology, you can secure new clients for our network of expert recruiters on a generous fee share.\nRecruiterlink provides you with all the tools and support you need to maintain and sustain your new position, there are NO FEES OR SETUP COSTS!\n\nBenefits:\n\nNo hard sell, no upfront fee\nWork your own hours\nOperate from anywhere\nUnique Platform\nUnlimited new prospects\nFull sales support\nUnlimited and uncapped earnings\n\nThis is a unique opportunity for someone to really make their mark and take ownership of their income as well as their future.\n\nIf you are ready to take that next step, drop me an email at , call me on (phone number removed) or apply through this advert for more information.\n\nBy applying for this role you accept the Jobzooma terms and conditions that can be found on our website and agree to receive email notification of other suitable jobs\nRole: Freelance Recruitment Business Development Manager\nJob Type: Contract\nLocation: London, Greater London,\n\nApply for this job now"
  },
  {
    "": "Bay and Brown\n\nMain Duties\n\nSales and Travel\n\nSkills and Experience\n\nBay and Brown is a leading textile print design studio started in 2005 based in London. Renowned throughout industry for its sophisticated hand painted designs. Selling worldwide in the Fashion Industry. We need an upbeat Sales Assistant to join our team to travel around the world and sell our artwork.\n\nYou must:\n• Be happy to travel 2-3 weeks a month\n• Have a full Uk drivers licence\n• Confident travelling and driving abroad\n• Great organisational skills\n• Problem solver with great time management\n• A people person\n• Have an interest in Textiles\n• Live in London\n\nNOT A DESIGN JOB"
  },
  {
    "": "FREELANCE GARMENT TECHNOLOGIST - SLEEPWEAR Employer: Fashion Personnel Salary: Day rate dependent on experience Reference: RC-39348LI My client is a a womenswear brand, who currently require a strong Garment Technologist to join them on Womenswear and Sleepwear\n\nYou will have experience in managing your own categories, and will be a experienced in managing the workload and your own fits\n\nYour main duties will include: •Running the fit session’s daily - 4 times a week •Writing up fit comments; adding in photo’s •Experience in grading, reviewing spec sheets and commodity product •Manufacturing experience out of India, China and Portugal is beneficial •Other general garment tech duties •Updating spec books and amending CADS •Updating admin systems – excel is desirable but not essential If you have relevant experience and you are looking for the opportunity to work as part of a great new team, apply now!"
  },
  {
    "": "What is Hubstaff Talent?\nIt’s great that you have decided to become a freelancer! Or maybe you have already been one for a long time.\n\nRegardless, you would probably agree that freelancers are often underpaid.\n\nWe can dig deep and point out why the industry is unfair to some of us.\n\nOr we can accept it, and make the best of the situation, with a platform that is for professionals.\n\nMeet Hubstaff Talent, where skills and experience will always weigh the heaviest!\n\nWorking with Hubstaff Talent in London\nHubstaff Talent makes it easy to find clients looking for freelancers. You will create a profile listing your skills and your availability, and wait for clients to contact you!\n\nKeep in mind that Hubstaff Talent differs greatly from other freelance websites.\n\nHow?\n\nHubstaff Talent offers more long-term opportunities with various features that cannot be found elsewhere!\n\nThere is no need to bid for tasks, which means that you can save time and concentrate on making money instead!\n\nIf you..."
  }
]